{"date": "Jan 11 2025", "updates": [{"title": "Noteworthy AI Research Papers of 2024 (Part One)", "short": "Noteworthy AI Research Papers of 2024 (Part 1): Mixtral's MoE, improved LoRA (DoRA), continual pretraining tips, DPO vs. PPO for alignment, LoRA's learning/forgetting trade-off, and the massive FineWeb dataset. Part 2 coming soon!", "long": "### January: Mixtral's Mixture of Experts\nMixtral 8x7B, a Mixture-of-Experts (MoE) model, outperformed other LLMs like Llama 2 70B and GPT-3.5.  MoE models efficiently use resources by activating only a subset of expert layers to process tokens, improving performance.\n\n### February: Weight-decomposed LoRA (DoRA)\nDoRA improves upon LoRA (low-rank adaptation), a parameter-efficient LLM fine-tuning method, by decomposing weight matrices into magnitude and direction. DoRA offers better performance and robustness, exceeding LoRA with fewer parameters.\n\n### March: Continual Pretraining of LLMs\nThis paper emphasizes simple yet effective strategies for continual pretraining, including re-warming/re-decaying learning rates and incorporating a small fraction of original training data to minimize catastrophic forgetting.\n\n### April: DPO vs. PPO for LLM Alignment\nThis study compared Direct Preference Optimization (DPO) and Proximal Policy Optimization (PPO) in RLHF (Reinforcement Learning with Human Feedback).  PPO generally outperformed DPO, particularly with out-of-distribution data, though DPO is simpler to implement.\n\n### May: LoRA's Learning and Forgetting\nThis research showed LoRA learns less new information but forgets less of its original knowledge compared to full fine-tuning, especially when dealing with dissimilar domains like coding.\n\n### June: FineWeb Dataset\nA massive 15 trillion token dataset, FineWeb, was released. This dataset surpasses others in size, making it suitable for training very large LLMs, increasing accessibility for LLM research. \n\nThe second half of 2024's research will be discussed in a future article.", "url": "https://magazine.sebastianraschka.com/p/ai-research-papers-2024-part-1"}, {"title": "LLM Research Papers: The 2024 List", "short": "My 2024 AI research highlights (LLMs focus).  Due to injury, I share my paper bookmark list instead of a full article!  Includes bonus links to my book & GitHub.  Hoping to fully recover & share my planned highlights soon!", "long": "### An eventful year in AI research\n\nThe article summarizes the author's 2024 research highlights, focusing on Large Language Models (LLMs). Due to an injury, the author couldn't complete a planned article but provides a curated list of interesting LLM-related research papers from 2024.\n\n### A curated list of research papers\n\nThe core of the article is a comprehensive list of LLM research papers, categorized by month (January to December 2024). Each paper is listed with its title, date of publication, and a link to its abstract on arXiv.\n\n### Additional Resources\n\nThe author also mentions supplementary resources: a book, \"Build A Large Language Model (From Scratch)\", offering in-depth explanations of LLM workings, and a GitHub repository with bonus materials.\n\n### Author's Note and Call to Action\n\nThe author explains their inability to fully complete the article due to a recent injury, expresses gratitude for reader support, and promotes their book and Substack subscription for continued support. The author promises to deliver the planned Research Highlights 2024 article in the upcoming weeks.", "url": "https://magazine.sebastianraschka.com/p/llm-research-papers-the-2024-list"}, {"title": "Understanding Multimodal LLMs", "short": "Multimodal LLMs are revolutionizing AI!  Learn about two main architectures (Unified Embedding Decoder & Cross-Modality Attention), recent models like Llama 3.2 & Molmo, and training techniques.  Discover the latest advancements in image-text processing and the challenges of model comparison. #MultimodalLLM #AI #LLM #MachineLearning", "long": "### Multimodal LLMs Explained\nMultimodal LLMs process various data types (text, images, audio, video).  This article focuses on image-text models.\n\n### Key Architectures\nTwo main architectures are discussed: Unified Embedding Decoder and Cross-Modality Attention.  The former concatenates image and text embeddings before feeding them into a decoder-only LLM; the latter integrates them directly into the attention layer.\n\n### Model Training\nTraining generally starts with a pre-trained text-only LLM.  The image encoder (often CLIP or a variant) and a projector (linear layer or MLP) are added.  Training involves stages: (1) pretraining the projector, (2) finetuning with the LLM unfrozen, and sometimes (3) additional finetuning for specific tasks.\n\n### Recent Models Reviewed\nThe article reviews several recent multimodal models: Llama 3.2 (cross-attention), Molmo (decoder-only), NVLM (decoder-only, cross-attention, and hybrid), Qwen2-VL (dynamic resolution), Pixtral 12B (decoder-only), MM1.5 (decoder-only, mixture-of-experts), Aria (cross-attention, mixture-of-experts), and Baichuan-Omni (decoder-only). Each has unique approaches to image encoding and training.\n\n### Conclusion\nMany successful approaches exist.  The choice depends on factors like ease of implementation and computational efficiency.  Benchmark comparisons are difficult due to data contamination issues.", "url": "https://magazine.sebastianraschka.com/p/understanding-multimodal-llms"}, {"title": "Building A GPT-Style LLM Classifier From Scratch", "short": "Learn to build a powerful text classifier using a pretrained LLM!  This article shows how to easily finetune a GPT model for spam detection, with results and additional experiments to optimize your performance. #LLM #TextClassification #SpamDetection #GPT #MachineLearning", "long": "### Building an LLM Classifier\nThis article details finetuning a pretrained large language model (LLM) for text classification, specifically spam detection.  It emphasizes the simplicity and efficiency of this approach compared to more complex instruction finetuning.\n\n### Why Classification?\nText classification addresses numerous real-world needs like spam filtering, sentiment analysis, and topic labeling.  Finetuning for classification provides a straightforward entry point into LLM adaptation.\n\n### Two Finetuning Methods\nThe article contrasts instruction finetuning (requiring task-specific instructions) with classification finetuning (predicting predefined classes).  Classification is more specialized but requires fewer resources.\n\n### Adapting the Model\nThe process involves freezing most of the pretrained LLM's layers and replacing the output layer with a smaller one tailored to the number of classes (e.g., two for spam/not spam).  The last transformer block and final LayerNorm are also made trainable for improved performance.\n\n### Focusing on the Last Token\nDue to the causal attention mask in GPT-like models, the last token in an input sequence contains the most contextual information.  Therefore, finetuning focuses on this token for classification.\n\n### Experimental Results\nExperiments demonstrate that the model achieves high accuracy (around 96%). Additional experiments explore various aspects, such as the effect of training all layers vs. only the last layer, comparing GPT to BERT, disabling the causal mask, model size impact, using LoRA, and the effect of padding.  Removing padding tokens notably improved results.\n\n### Conclusion\nThe article highlights how to effectively build a high-performing LLM classifier from scratch, focusing on practical efficiency and detailed experimental results.", "url": "https://magazine.sebastianraschka.com/p/building-a-gpt-style-llm-classifier"}, {"title": "Building LLMs from the Ground Up: A 3-hour Coding Workshop", "short": "Learn to build LLMs from scratch! This 3-hour coding workshop video covers everything from basic architecture to finetuning with GPT-2 & Llama 2. Get the code and more on GitHub! #LLM #AI #MachineLearning #DeepLearning #codingworkshop", "long": "### A 3-Hour Coding Workshop on LLMs\nThis article presents a 3-hour coding workshop on building large language models (LLMs) from the ground up. The workshop is presented as a YouTube video with clickable chapter marks for easy navigation to specific topics.\n\n### Workshop Content\nThe workshop covers various aspects of LLM development, including an introduction to LLMs, understanding LLM input data, coding an LLM architecture (using GPT-2 and Llama 2 as examples), pretraining, loading pretrained weights, instruction finetuning, benchmark evaluation, and evaluating conversational performance.\n\n### Practical Coding\nThe workshop includes hands-on coding sessions, demonstrating the implementation of a simple tokenizer class and showcasing different techniques for pretraining and finetuning LLMs.  Both basic implementations and approaches using the LitGPT library are demonstrated.\n\n### Workshop Resources\nThe article provides links to the workshop materials, including a GitHub repository with the code used in the workshop and a Lightning Studio project.  It also references the author's book, \"Build an LLM from Scratch,\" for more in-depth understanding.\n\n### Support the Author\nThe author encourages readers to support the project by purchasing their book or subscribing to their Substack.  Reviews of the book are greatly appreciated to help authors reach a wider audience.\n\n### Conclusion\nThe workshop is a valuable resource for those seeking a practical understanding of LLM development, offering a comprehensive overview and practical coding examples.", "url": "https://magazine.sebastianraschka.com/p/building-llms-from-the-ground-up"}, {"title": "New LLM Pre-training and Post-training Paradigms", "short": "LLM training is evolving!  New models like Qwen 2, AFM, Gemma 2, and Llama 3 use multi-stage pre-training, knowledge distillation (Apple & Google), and varied post-training techniques (SFT, RLHF/DPO, rejection sampling). Model averaging improves performance.  Learn more about these fascinating advancements in my latest article!", "long": "### New LLM Training Paradigms\nThis article analyzes recent advancements in Large Language Model (LLM) training, focusing on four prominent models: Alibaba's Qwen 2, Apple's AFM, Google's Gemma 2, and Meta's Llama 3.  The traditional pre-training-only approach has evolved to incorporate post-training techniques like supervised fine-tuning (SFT) and reinforcement learning from human feedback (RLHF), or its more efficient alternative, direct preference optimization (DPO).\n\n### Multi-Stage Pre-training\nAll four models employ multi-stage pre-training.  A core pre-training phase is followed by context-lengthening stages, often incorporating synthetic data, to enhance performance.  Data quality is emphasized over sheer quantity.\n\n### Knowledge Distillation\nApple and Google utilize knowledge distillation, training smaller models using outputs from larger teacher models, resulting in efficient and effective LLMs without needing massive datasets.  \n\n### Post-training Techniques\nPost-training methods vary across models.  While SFT is common, preference tuning differs; some models use DPO, others RLHF.  Rejection sampling is popular to select responses during training.\n\n### Model Averaging\nGoogle and Meta use model averaging techniques, combining parameters from multiple model checkpoints to improve stability and performance.  The Llama 3.1 uses a more iterative approach to this technique, applying it across multiple rounds of SFT and DPO.\n\n### Conclusion\nThe article highlights that there is no one-size-fits-all approach to LLM training.  Multiple strategies are employed, resulting in similar performance across different models.", "url": "https://magazine.sebastianraschka.com/p/new-llm-pre-training-and-post-training"}, {"title": "Instruction Pretraining LLMs", "short": "New research on instruction finetuning for LLMs is making waves!  Cost-effective data generation, improved pretraining methods, and efficient LLMs like Google's Gemma 2 are transforming the field.  Plus, a from-scratch instruction finetuning guide is available in my new book! #LLM #AI #InstructionFinetuning #Gemma2 #MachineLearning", "long": "### Instruction Finetuning\nThe article focuses on recent research in instruction finetuning for Large Language Models (LLMs).  It highlights a new cost-effective method for generating instruction data from scratch using an LLM, eliminating the need for large, manually curated datasets. This method, detailed in the Magpie paper, shows surprisingly high-quality results. \n\n### Finetuning from Scratch\nThe article also discusses Chapter 7 of Sebastian Raschka's book \"Build a Large Language Model From Scratch\", which offers a comprehensive guide to instruction finetuning. The chapter walks through the entire pipeline, covering practical implementation details. \n\n### Instruction Pretraining\nAnother research paper, \"Instruction Pre-Training,\" is reviewed. It explores enhancing LLM pretraining with synthetic instruction data, improving efficiency and downstream performance compared to traditional pretraining methods. Both small and large models are examined with this method, showing improvements.  \n\n### Gemma 2\nGoogle's Gemma 2 LLMs are discussed, emphasizing efficiency improvements through architectural changes. Sliding window attention and grouped-query attention reduce computational costs, while knowledge distillation leverages a larger model to improve smaller ones. Ablation studies are praised in the report. \n\n### Other Research Papers\nFinally, the article includes a list of additional interesting research papers from June 2024, covering various topics including dataset creation, model alignment, and efficient attention mechanisms.  Several significant papers are highlighted.", "url": "https://magazine.sebastianraschka.com/p/instruction-pretraining-llms"}, {"title": "Developing an LLM: Building, Training, Finetuning", "short": "Learn about the entire LLM development lifecycle in this 1-hour video!  From data prep & architecture to various finetuning methods & evaluation techniques, this presentation covers it all. #LLM #AI #MachineLearning #DeepLearning", "long": "### Understanding LLMs\nThis article provides a comprehensive overview of Large Language Models (LLMs), focusing on their development lifecycle.  It's presented as a one-hour video lecture, making it easily digestible on the go.\n\n### LLM Development Stages\nThe video details the key stages involved in building an LLM, from data gathering and preparation to the crucial pretraining and finetuning phases. This includes discussions on dataset selection, tokenization techniques, and architectural choices.\n\n### LLM Architecture\nThe presentation delves into the underlying architecture of LLMs, explaining the complexities and design considerations.  This section offers a simplified explanation of how these models function.\n\n### Finetuning Methods\nDifferent finetuning techniques are explored, such as classification, instruction, and preference finetuning, along with practical examples of each.  The nuances of these methods are highlighted for a thorough understanding.\n\n### Evaluating LLMs\nThe article emphasizes the importance of evaluating LLMs effectively.  It examines various evaluation methods and critically discusses their strengths and weaknesses, providing important insights into assessing model performance.\n\n### Practical Tips\nFinally, the author shares practical tips and rules of thumb for both pretraining and finetuning, offering valuable advice to those involved in LLM development or seeking to learn more about them. The information is concise and well-structured for mobile consumption.", "url": "https://magazine.sebastianraschka.com/p/llms-building-training-finetuning"}, {"title": "LLM Research Insights: Instruction Masking and New LoRA Finetuning Experiments", "short": "New LLM research shows unmasking instructions during finetuning can improve performance, while LoRA excels at preserving pre-trained knowledge despite learning less new information. MoRA, a high-rank update method, shows promise for incorporating new knowledge.  Check out the full article for these insights & more recent research! #LLM #AI #MachineLearning #LoRA #MoRA", "long": "### Instruction Tuning with Loss Over Instructions\nThis paper challenges the common practice of masking instructions during instruction tuning of LLMs.  Experiments show that not masking instructions (instruction modeling), while seemingly simpler, can lead to better performance, especially with shorter responses and smaller datasets.  The performance gain is attributed to reduced overfitting.\n\n### LoRA Learns Less and Forgets Less\nThis study empirically compares LoRA and full fine-tuning across programming and mathematics domains.  Results indicate that LoRA learns less new information but retains knowledge from the pre-trained model better than full fine-tuning.  The difference is more pronounced when the task is further from the model's pre-training data.\n\n### MoRA: High-Rank Updating for Parameter-Efficient Finetuning\nMoRA, a new parameter-efficient fine-tuning method, is introduced as an alternative to LoRA.  Instead of low-rank updates, it utilizes a square matrix for higher-rank updates.  While showing similar performance to LoRA on some tasks, MoRA excels in continued pre-training, suggesting it's a better option for acquiring new knowledge, though potentially less effective for tasks like instruction tuning.\n\n### Other Interesting Research Papers in May\nThe article also provides a list of other notable research papers published in May 2024, covering topics like positional encoding, neural architecture search for LLMs, memory-efficient training, data-dependent scaling laws, and model alignment and personalization.", "url": "https://magazine.sebastianraschka.com/p/llm-research-insights-instruction"}, {"title": "How Good Are the Latest Open LLMs? And Is DPO Better Than PPO?", "short": "April's open LLM releases (Mixtral, Llama 3, Phi-3, OpenELM) are game changers!  A new study shows PPO generally outperforms DPO for LLM alignment, but both are crucial.  Plus, a roundup of other exciting AI research papers. #LLMs #AI #MachineLearning #OpenSourceAI", "long": "### April 2024: A Big Month for Open LLMs\n\nThe article discusses the major open LLM releases in April 2024: Mixtral, Llama 3, Phi-3, and OpenELM.  Mixtral 8x22B uses a mixture-of-experts architecture, demonstrating strong performance with relatively low computational requirements. Llama 3, trained on a massive dataset (15 trillion tokens), significantly outperforms its predecessor, Llama 2, showcasing the benefits of larger training data.  Phi-3, while trained on less data, achieves comparable results by focusing on higher-quality data. Finally, Apple's OpenELM offers a family of efficient, small LLMs designed for mobile deployment, with a transparently-documented training process and open-source framework.\n\n### DPO vs. PPO for LLM Alignment\nA recent study compares the effectiveness of Proximal Policy Optimization (PPO) and Direct Preference Optimization (DPO) for LLM alignment via reinforcement learning.  The research shows that PPO generally outperforms DPO, especially when dealing with out-of-distribution data, though DPO remains popular for its simplicity. Best practices for using both methods are outlined.\n\n### Other Notable Research Papers\nThe article also highlights several other important papers from April 2024, covering areas like improving model efficiency, code understanding, long-context processing, multimodal learning, and addressing challenges in LLM alignment and safety. These papers introduce novel architectures, training techniques, and evaluation methods, advancing the field of LLMs.", "url": "https://magazine.sebastianraschka.com/p/how-good-are-the-latest-open-llms"}, {"title": "Using and Finetuning Pretrained Transformers", "short": "Learn how to use & finetune pretrained LLMs!  3 key methods: feature-based approach (efficient but may limit performance), in-context learning (great for limited data), & parameter-efficient fine-tuning (balances efficiency & performance).  Plus, discover Reinforcement Learning with Human Feedback. #LLMs #AI #MachineLearning #DeepLearning", "long": "### Using and Finetuning Pretrained Transformers\nThis article explores different methods for using and fine-tuning pretrained large language models (LLMs).  The author, Sebastian Raschka, PhD, explains three primary approaches:\n\n### Feature-Based Approach\nThis method uses the pre-trained LLM as a feature extractor. Embeddings from the LLM are generated and fed into a new downstream model (often a linear classifier) which is then trained on the dataset. This is computationally efficient but may limit performance.\n\n### In-Context Learning\nIn this approach, examples of the target task are provided within the input prompt itself, allowing the LLM to infer the desired behavior without further parameter updates. This method is useful when labeled data is scarce, but may not achieve the same performance as finetuning.\n\n### Parameter-Efficient Fine-tuning\nThis encompasses several methods like soft prompting, prefix tuning, and adapter methods.  These modify the LLM with minimal added parameters, improving performance without the computational expense of full fine-tuning.\n\n### Reinforcement Learning with Human Feedback (RLHF)\nBeyond the efficient fine-tuning methods, RLHF is presented as a way to enhance LLM performance by aligning it with human preferences. A reward model is trained using human feedback to guide the LLM's learning.\n\n### Conclusion\nThe article concludes that each method offers a trade-off between computational cost and performance. It is important to consider what method to choose based on project requirements.", "url": "https://magazine.sebastianraschka.com/p/using-and-finetuning-pretrained-transformers"}, {"title": "Tips for LLM Pretraining and Evaluating Reward Models", "short": "New research on efficient LLM pretraining shows continued pretraining, with learning rate re-warming & adding small fraction of original data, matches retraining performance at lower cost.  A new RewardBench benchmark evaluates reward models in RLHF, while DPO also shows promise.  See more in the latest Ahead of AI newsletter!", "long": "### Continued Pretraining of LLMs\nThis article explores a research paper detailing cost-effective strategies for continually pre-training LLMs.  The key finding is that continued pre-training, re-using a pre-trained model and adding new data, achieves comparable performance to retraining from scratch with combined datasets, significantly reducing computational cost and time.  The study recommends re-warming and re-decaying the learning rate schedule, along with adding a small fraction (0.5%-5%) of original data to mitigate catastrophic forgetting.\n\n### Reward Modeling Evaluation\nThe article also summarizes another paper introducing RewardBench, a new benchmark for evaluating reward models in reinforcement learning with human feedback (RLHF). RewardBench assesses the model's ability to accurately assign higher scores to preferred responses compared to rejected ones. This benchmark helps determine the effectiveness of reward models, crucial for aligning LLMs with human preferences.\n\nThe article compares RLHF using separate reward models and the simpler Direct Preference Optimization (DPO).  DPO shows promising results but lacks comparable model testing against RLHF methods, with further research required to confirm its superior performance.\n\n### Other Interesting Papers\nFinally, the article provides a curated list of notable AI research papers from March 2024, highlighting those related to efficiency, improved model performance, multimodal models, and addressing malicious use cases.", "url": "https://magazine.sebastianraschka.com/p/tips-for-llm-pretraining-and-evaluating-rms"}, {"title": "Research Papers in February 2024: A LoRA Successor, Small Finetuned LLMs Vs Generalist LLMs, and Transparent LLM Research", "short": "Exciting February in AI research!  Two new open-source LLMs, OLMo (fully transparent) & Gemma (state-of-the-art), plus insights into small LLMs vs. large ones, and DoRA, a potential LoRA successor.  Plus a list of other key February AI papers!", "long": "### Research Papers in February 2024\n\nThis month's AI research highlights include two new openly available LLMs: OLMo (fully open-source) and Gemma (state-of-the-art performance on several benchmarks).\n\n### Small vs. Large LLMs\n\nA study, \"Tiny Titans,\" investigated whether smaller LLMs (under 2B parameters) could outperform larger ones.  Results showed mixed results; smaller, finetuned models excelled in specific domains but lagged behind larger models on broader datasets, possibly due to context window limitations.\n\n### DoRA: A LoRA Successor\n\nDoRA, a new parameter-efficient fine-tuning technique, was introduced as a potential improvement over LoRA, providing comparable performance with reduced computational costs.\n\n### OLMo: Transparent LLM Research\n\nThe OLMo model stands out for its complete transparency, sharing training code, data, and log files.  Key architectural choices, such as disabling bias vectors and using a simplified LayerNorm variant, are discussed.\n\n### Gemma: High-Performing Open-Source LLM\n\nGemma, a suite of LLMs by Google, shows impressive performance against Llama 2 and Mistral. Its large vocabulary, extensive training data, and architectural similarities to Llama 2 contribute to its success.  Differences like GeGLU activations and RMSNorm modifications are highlighted.\n\n### Other Notable Papers\n\nThe article also briefly summarizes other important research papers from February 2024, focusing on 1-bit LLMs, efficient training optimization, and extending context windows in LLMs, among others. These papers are highlighted and listed with their links.\n\n### Machine Learning Q and AI\n\nThe author mentions their upcoming book, \"Machine Learning Q and AI,\" offering accessible content on intermediate to advanced machine learning concepts.", "url": "https://magazine.sebastianraschka.com/p/research-papers-in-february-2024"}, {"title": "Improving LoRA: Implementing Weight-Decomposed Low-Rank Adaptation (DoRA) from Scratch", "short": "LoRA efficiently finetunes LLMs.  DoRA improves LoRA by decomposing weights into magnitude and direction, applying LoRA to the direction, and training magnitude separately.  PyTorch implementations for both are provided, showing DoRA's superior performance and robustness even with fewer parameters. #LLM #finetuning #LoRA #DoRA #PyTorch", "long": "### LoRA: Efficient Finetuning for LLMs\nLow-rank adaptation (LoRA) efficiently finetunes large language models (LLMs) by adjusting a small subset of parameters, reducing computational costs.  It approximates weight updates (\"ΔW\") as a product of two smaller matrices (\"AB\"), significantly decreasing the number of parameters needing adjustment.\n\n### DoRA: An Enhancement of LoRA\nDoRA (Weight-Decomposed Low-Rank Adaptation) improves upon LoRA.  It decomposes the original weight matrix (\"W\") into magnitude (\"m\") and direction (\"V\") components.  LoRA is then applied to the direction component, and the magnitude is trained separately.\n\n### LoRA Implementation in PyTorch\nThe article provides a PyTorch implementation of a LoRA layer (`LoRALayer`) and shows how to integrate it into an existing `Linear` layer (`LinearWithLoRA`).  It also illustrates an alternative implementation using weight merging. A simple 3-layer Multilayer Perceptron example demonstrates the application of LoRA.\n\n### DoRA Implementation in PyTorch\nBuilding on the LoRA implementation, a DoRA layer (`LinearWithDoRAMerged`) is created. This layer includes weight normalization and a learnable magnitude vector. The process of applying DoRA to the Multilayer Perceptron is demonstrated.\n\n### Performance and Robustness\nDoRA, even with a halved rank compared to LoRA, often outperforms LoRA in benchmarks. This makes DoRA more parameter-efficient and less sensitive to rank hyperparameter choices.\n\n### Conclusion\nDoRA presents a promising advancement over LoRA.  The article provides code implementations for both methods in PyTorch, empowering readers to apply these techniques to their own LLM finetuning projects.", "url": "https://magazine.sebastianraschka.com/p/lora-and-dora-from-scratch"}, {"title": "Model Merging, Mixtures of Experts, and Towards Smaller LLMs", "short": "LLM advancements in 2024 focus on improvement without size increase.  Model merging/weight averaging, proxy tuning, Mixtral 8x7B (sparse MoE), and TinyLlama (small, open-source) are highlighted.  These methods offer efficiency and performance comparable to much larger models, making them attractive for various applications.", "long": "### Model Merging and Weight Averaging\nThis technique combines multiple LLMs into a single, improved model, unlike traditional ensembles.  Weight averaging, a key component, averages model weights from different training stages or even different models to enhance performance and robustness.\n\n### Proxy Tuning\nThis method improves existing LLMs without altering their weights. It leverages two smaller models: a base and a fine-tuned version.  The difference in their logits is applied to the target model's logits during decoding, leading to significant performance gains across various tasks.\n\n### Mixtral 8x7B\nMixtral is a sparse Mixture of Experts (MoE) model. It uses 8 expert subnetworks, only activating 2 at each step for efficiency.  This approach achieves performance comparable to, or even exceeding, much larger LLMs.\n\n### TinyLlama\nTinyLlama is a small (1.1B parameter) open-source LLM.  Small LLMs offer accessibility, affordability, and ease of customization, making them ideal for research, education, and resource-constrained settings.  This model shows that training for multiple epochs can be beneficial even on very large datasets.", "url": "https://magazine.sebastianraschka.com/p/research-papers-in-january-2024"}, {"title": "Understanding and Coding Self-Attention, Multi-Head Attention, Cross-Attention, and Causal-Attention in LLMs", "short": "Learn & code self-attention, multi-head, cross-attention, & causal attention mechanisms in LLMs from scratch using PyTorch!  This article provides a hands-on tutorial, perfect for understanding the core of transformer architectures. #LLMs #SelfAttention #PyTorch #Transformer #AI", "long": "### Self-Attention Mechanism\nThis article provides a comprehensive guide to understanding and coding self-attention mechanisms, a core component of Large Language Models (LLMs). It builds upon a previous blog post, modernizing and expanding the content for a mobile audience.\n\n### Coding Self-Attention in PyTorch\nThe article steps through a Python and PyTorch implementation of self-attention from scratch, focusing on the scaled dot-product attention mechanism. This hands-on approach offers a deeper understanding of the inner workings.\n\n### Multi-Head Attention\nThe concept of multi-head attention is introduced as an extension of self-attention. It explains how multiple attention heads, each with its own query, key, and value matrices, work in parallel to capture different relationships within the input sequence.\n\n### Cross-Attention\nCross-attention is covered as a variant where attention is computed between two different input sequences, rather than within a single sequence.  This is explained and illustrated with reference to models such as Stable Diffusion.\n\n### Causal Self-Attention\nCausal self-attention (or masked self-attention) is described, emphasizing its importance in generating text sequentially in autoregressive models like GPT. The code implementation uses masking to prevent the model from attending to future tokens in the sequence.\n\n### Conclusion\nThe article concludes with a summary of the covered attention mechanisms and a note on optimized implementations like FlashAttention for training large-scale LLMs. It also encourages readers to support the author's work through purchasing his book.", "url": "https://magazine.sebastianraschka.com/p/understanding-and-coding-self-attention"}, {"title": "Predictions for AI in 2025", "short": "Predictions for AI in 2025: Test-time compute dominates, multiple AI application unicorns, large acquisitions, steady venture investment.  Google surpasses Anthropic in Arena ELO.  Federal investment in AI surges. #AI #ArtificialIntelligence #Predictions2025", "long": "### Predictions for AI in 2025\n\nThis article presents predictions for the AI field in 2025, categorized into Foundation Models and AI Applications, along with miscellaneous predictions and qualitative observations.  The authors, Vikram Sreekanti and Joseph E. Gonzalez, assign confidence levels (50%, 70%, 90%) to each prediction.\n\n### Foundation Models\n\nThe authors predict continued reliance on test-time compute to enhance model reasoning skills.  They foresee a high score on the ARC AGI benchmark (90%+), and anticipate that Anthropic or Google will match OpenAI's score (70%).  They predict that Llama 4 will introduce optimized inference-time techniques (70%), and that the cost of OpenAI's 'o' series models will decrease (70%).  They also offer predictions regarding GPT-5's release (50%) and Claude 4's capabilities (70%).\n\n### AI Applications\n\nThe authors expect significant growth in the AI application market, with the emergence of multiple new unicorns (70%). Large tech companies are predicted to make substantial acquisitions in the sector (90% for a $500MM+ acquisition and 70% for a $1B+ acquisition), while maintaining relatively steady venture investment (90%). They also predict that AI cost savings will be publicized by financial institutions (70%) and that there will be no large-scale AI-related layoffs (70%).\n\n### Miscellanea\n\nThe authors project significant US federal investment in AI ($1B+)(90%), and that Google's model will surpass Anthropic's in Arena ELO (70%).  They forecast Perplexity's limited user growth (90%), and a reduction in AI infrastructure investment (70%). They also predict that at least one AI unicorn will be created with fewer than 100 employees. \n\n### Qualitative Predictions\n\nQualitative predictions include a significant shift in company operations due to AI adoption (90%),  the persistent challenge of agent gullibility (70%), the release of a successful non-chat-based AI application (70%), and a major increase in AI application revenue (10x).", "url": "https://frontierai.substack.com/p/predictions-for-ai-in-2025"}, {"title": "Looking back on AI in 2024", "short": "2024 AI predictions reviewed: Open-source LLMs exceeded expectations, while GPT-4 pricing and Gemini's performance were surprises.  Key lessons learned: deliver value, prioritize trust, and master AI UX.  Happy Holidays!", "long": "### 2024 AI Predictions: A Self-Assessment\n\nThe authors reflect on their 2024 AI predictions, acknowledging inaccuracies and offering insights.  Their predictions regarding open-source LLMs were overly pessimistic; they underestimated the advancements and funding secured by open-source LLM companies.\n\n### Key Predictions and Outcomes\n\nOpenAI's GPT-4 pricing didn't decrease as dramatically as anticipated, while the success of Gemini surprised them.  Open-source models like Llama 3 performed better than projected.  They also note underestimating the impact of smaller, equally performant models, a trend they call \"test-time compute\".\n\n### Top Posts of 2024\n\nTheir most viewed post, \"Throw more AI at your problems,\" unexpectedly surpassed others focusing on market analysis or AI strategy. This shows the rising interest in compound AI.\n\n### Lessons Learned\n\nThree major lessons emerged: 1. AI companies must deliver concrete business value. 2. Customer trust is paramount, exceeding the importance of overly technical evaluations.  3. AI UX requires continuous innovation to match AI advancements.  Seamless transitions between AI and human input are crucial.", "url": "https://frontierai.substack.com/p/looking-back-on-ai-in-2024"}, {"title": "Compound AI is AGI", "short": "Is AGI here?  FrontierAI says YES!  Their article argues that combining multiple AI models (compound AI) has already achieved AGI, surpassing single-model limitations and challenging the traditional AGI definition.  Read now to learn more!", "long": "### Compound AI Achieved AGI?\n\nThe authors contend that current Large Language Models (LLMs) have already achieved Artificial General Intelligence (AGI).  They challenge the common definition of AGI as residing within a single, self-contained system.\n\n###  Redefining AGI\n\nInstead, they propose AGI is achievable through the composition of multiple models working together.  This \"compound AI\" approach mimics human intelligence where diverse skills are combined.  Just as a human is not uniformly skilled in all areas, individual models specialize, enhancing overall system capabilities.\n\n### Countering the Arguments\n\nThe authors address potential counterarguments. The idea that compound AI only simulates true AGI is challenged by the emergent nature of intelligence itself. The analogy of the human brain's collaborative neural networks is drawn to illustrate this. The limitation of a single model isn't a limitation of AGI as a concept.\n\n### The Intelligence Gap\n\nWhile acknowledging that current AI systems do not surpass human abilities in all areas (physical intelligence, for example), they emphasize that surpassing human intelligence is not a prerequisite for AGI. LLMs already perform tasks exceeding human capabilities in specific domains (speed of information retrieval, for example).\n\n### The Conclusion\n\nThe authors conclude that AGI is not a singular event in the future but rather a present capability.  The development of generalizable intelligence is a matter of refining existing components and investment, not fundamental breakthroughs.  They encourage a shift in focus from the AGI debate to further exploration of consciousness and the ethical implications of highly intelligent systems.", "url": "https://frontierai.substack.com/p/compound-ai-is-agi"}, {"title": "The end of scaling laws doesn't matter", "short": "LLM progress has slowed, but that's irrelevant!  Successful AI adoption hinges on application quality & user experience, not just better models.  Focus on building great apps, not waiting for GPT-5!", "long": "### The Slowdown in LLM Advancement Doesn't Matter\n\nLarge Language Models (LLMs) haven't been advancing as rapidly as in previous years, leading to questions about the future.  This article argues that this slowdown is insignificant because the biggest hurdles to AI adoption aren't the models themselves, but the quality of applications and user acceptance.\n\n### Focus on Application Quality and UX\n\nThe article emphasizes that creating high-quality, user-friendly AI applications is more critical for widespread adoption than constantly improving LLMs. Many existing models already possess the necessary capabilities; the key is effective implementation.\n\n### Cursor as an Example of Excellent UX\n\nCursor, a successful AI-powered developer tool, is cited as an example. While its underlying AI is not revolutionary, its intuitive user experience drives its popularity, highlighting the importance of UX over raw model power.\n\n### Addressing Organizational Resistance\n\nThe article acknowledges the challenge of organizational resistance to AI adoption, often stemming from fears of job displacement or a preference for in-house development.  It proposes that the benefits of leveraging existing technology outweigh the risks and delays associated with these concerns.  The article suggests that the current technology is sufficient to unlock productivity gains.\n\n### RunLLM's Experience Reinforces the Point\n\nThe authors' own experience with RunLLM, an LLM application, supports their argument, showing consistent positive user feedback on productivity improvements despite using currently available LLMs.\n\n### Future LLM Improvements are Secondary\n\nWhile acknowledging potential future improvements in LLMs, the authors believe focusing on UX and wider adoption of current technology yields immediate benefits. This proactive approach is considered more crucial than speculative forecasting on future LLM developments.  They encourage focusing on creating valuable applications to survive any potential 'AI winter'.", "url": "https://frontierai.substack.com/p/the-end-of-scaling-laws-doesnt-matter"}, {"title": "Your AI strategy is a waste of time", "short": "Forget elaborate AI strategies!  Rapid advancements make centralized planning obsolete. Empower teams to select AI tools based on their specific needs, experiment, and embrace the inevitable failures. The best AI strategy?  Simply use more AI!", "long": "### Stop wasting time on AI strategies. \n\nThe authors argue that a formal AI strategy is futile due to the rapid pace of AI development.  Instead of focusing on a comprehensive plan, they suggest a simpler approach: **use more AI**. They believe that a centralized strategy won't effectively address the diverse needs across an organization's various departments. \n\n### Decentralize AI adoption. \n\nThe authors recommend empowering individual teams to select AI tools based on their specific needs and evaluation criteria.  This approach mirrors a business strategy where each department decides their own hiring practices rather than a singular company-wide strategy. \n\n### Effective AI implementation needs thoughtful evaluation.\n\nWhile a general AI strategy is deemed unproductive, having clear evaluation criteria is crucial.  Teams must prioritize factors such as speed, accuracy, and user experience, creating precise criteria for selecting suitable tools.  The focus should be on the practical impact rather than broad, abstract societal implications. \n\n### Embrace experimentation and failure.\n\nThe authors emphasize the importance of experimentation and accepting some inevitable failures. The early stage of AI development makes perfect decisions challenging.  Treating AI adoption as an iterative learning process will sharpen evaluation skills over time and increase the chance of finding valuable applications. \n\n### Don't let bureaucracy slow you down. \n\nOverly bureaucratic processes and central decision-making bodies often hamper AI adoption.  Removing unnecessary obstacles within an organization facilitates quicker integration and allows teams to leverage AI benefits promptly.  This includes streamlining approval processes for AI tools and not getting stuck on questions that are not pertinent to AI's use case.\n\n### Embrace AI across your organization.\n\nThe authors conclude by suggesting the simplest and most effective AI strategy is to incorporate AI tools into as many departments and functions as realistically possible.  Instead of complex, long-term strategic planning, the immediate focus should be on practical implementation and iterative improvement.", "url": "https://frontierai.substack.com/p/your-ai-strategy-is-a-waste-of-time"}, {"title": "AI lets you scalably do things that don't scale", "short": "AI lets you scalably personalize tasks previously considered non-scalable, like custom sales outreach & tech support.  This is a game-changer for startups scaling efficiently, but not in the earliest stages. #AI #LLMs #Startups #Scaling", "long": "### AI Enables Scalable \"Things That Don't Scale\"\n\nThe article discusses how AI, specifically Large Language Models (LLMs), allows businesses to perform highly personalized tasks at scale, contradicting the traditional startup advice of \"doing things that don't scale.\"  This is because LLMs can provide customized experiences for many customers, something previously impossible with human-only operations.\n\n### Examples in Practice\n\nThe author illustrates this with several examples:\n\n* **Sales Development:** AI-powered SDRs can create personalized email content for all prospects.  This allows customized outreach at a scale previously impossible.\n* **Technical Support:** AI support engineers can customize code, translate languages, and offer detailed explanations, greatly enhancing customer experience. \n* **Software Engineering:**  AI developer assistants automate tedious engineering tasks, letting humans focus on more creative aspects. High-quality work becomes achievable at scale.\n\n### Beyond Initial Stages\n\nThe article emphasizes that this approach is most suitable for startups beyond the initial product-definition and customer-discovery phases.  Early on, human interaction is crucial for developing a strong understanding of the customer needs. However, at a later stage, the AI can be highly beneficial to scaling efficiently.\n\n### AI and Human Collaboration\n\nThe author makes it clear that AI is not intended to replace humans entirely.  It enhances human productivity and allows teams to accomplish more with fewer staff during initial growth. When scaling increases, the existing workforce will have become more productive thanks to AI tools. AI assists in tasks previously considered non-scalable, letting the team focus on higher-value work.\n\n### Key Takeaway\n\nAI is not just automation; it enables highly customized interactions at scale, shifting how businesses approach scaling operations and allowing for leaner growth.", "url": "https://frontierai.substack.com/p/ai-lets-you-scalably-do-things-that"}, {"title": "Can I talk to an AI, please?", "short": "RunLLM's year of experience shows AI isn't just automating tasks; it's changing user behavior, boosting productivity & creating new demand. Users shift from simple questions to iterative refinement, unlocking valuable insights and revenue opportunities beyond cost savings. The AI market is evolving fast!", "long": "### AI Product Maturation: A User Behavior Shift\n\nRunLLM's experience reveals a significant shift in user behavior with AI products.  Initially, users approach AI like human support agents, asking simple, direct questions.  However, successful users quickly adapt, utilizing AI iteratively to refine answers, demonstrating a non-linear increase in productivity.\n\n### Augmented, Not Replaced Demand\n\nContrary to initial assumptions, AI doesn't replace demand but expands it.  Users readily customize and debug code generated by AI, creating new work and opportunities. This contrasts with traditional support interactions where such customization is impractical.\n\n### Unveiling Hidden Insights\n\nAI tools provide unprecedented user insights.  Removing the fear of asking simple questions, users reveal insights into usage patterns, confusion areas, and unmet needs. This data is impossible to obtain using traditional methods.\n\n### From Cost Savings to Revenue Growth\n\nAI's initial focus is on cost reduction. Yet, by enabling faster adoption and resolving issues efficiently, AI boosts customer satisfaction, encouraging further engagement and potential upsells, turning it into a top-line driver.\n\n### An Evolving Market\n\nThe AI market is still early, with user behavior and market dynamics evolving rapidly.   RunLLM's experience suggests that AI will foster more demand than it replaces, making it crucial for startups to adapt to this rapidly evolving landscape.", "url": "https://frontierai.substack.com/p/can-i-talk-to-an-ai-please"}, {"title": "Compound AI, test-time compute, and wasting your users’ time", "short": "Compound AI is trending, but increased \"test-time compute\" makes apps slower.  Learn from past ML solutions: use multiple models, parallel inference, and AsyncAI to keep users engaged and get better answers faster. #AI #LLM #compoundAI #testtimecompute #UX", "long": "### Compound AI: The New Trend\nCompound AI, combining LLMs with business logic, is gaining popularity, but it comes with challenges.  The increased use of \"test-time compute\" for better reasoning results in significantly slower response times for applications.\n\n### Latency Concerns\nThe rising use of more powerful models and the inherent increase in compute time for each prompt leads to slower user experience. Although AI is theoretically faster and more accurate than humans, user expectations don't always reflect that.  The solution isn't just waiting for faster models; a new paradigm is needed.\n\n### Lessons from the Past\nThe challenges of latency aren't new.  In 2016, similar issues were overcome by minimizing latency in ML systems. Techniques like model cascades, where simpler models are used first, allowing more complex models to be employed only when necessary, were effective in optimizing the response time.\n\n### Solutions for Faster AI\nSeveral key strategies are suggested:\n\n*   **Use Multiple Models:** Don't rely on only the most powerful model for every task. Smaller models can handle easier tasks quickly, improving the overall efficiency. \n*   **Ensemble Models and Parallel Inference:** Employ model ensembles (multiple models working together) and parallel inference to minimize latency. Faster, cheaper models can provide quick answers, and more powerful ones can refine the results concurrently. \n*   **AsyncAI:** Return initial results promptly and refine them later. The user doesn't have to wait for the full analysis, improving their experience.  \n\n### Looking Ahead\nWhile compound AI is promising, there's a need to integrate lessons learned from past ML challenges to create faster, more user-friendly AI applications. The path forward requires a mix of systems engineering, thoughtful UX, and innovative product design.", "url": "https://frontierai.substack.com/p/compound-ai-test-time-compute-and"}, {"title": "Throw more AI at your problems", "short": "Stop relying on single, giant LLMs! RunLLM's approach: break down AI problems into smaller chunks, each handled by a smaller, more efficient LLM.  This improves reliability, reduces cost & latency, and enhances resilience to prompt hacking.  More AI calls = better AI apps!", "long": "### Throw More AI at Your Problems\n\nThis article explores a novel approach to building AI applications: using multiple LLM calls to solve complex problems.  The authors, from RunLLM, propose this as a superior alternative to relying solely on a single, powerful LLM.\n\n### Breaking Down Complexity\n\nInstead of tackling a problem with one massive LLM call, the authors advocate for breaking it into smaller, manageable components. Each component can be handled by a smaller, more efficient LLM. This makes it easier to fine-tune individual steps and improve overall system reliability, lowering costs and latency.\n\n### Addressing Cost and Latency Concerns\n\nThe authors acknowledge that multiple LLM calls can increase cost and latency.  They suggest addressing latency through parallelization and asynchronous workflows.  Cost-effectiveness is improved by using smaller, more appropriate models for individual tasks, instead of a large, computationally expensive model for the entire problem.\n\n### Improved Resilience and Incremental Development\n\nThis approach improves resilience to prompt hacking attempts as a problem in one step won't affect the entire system.  Further, it enables incremental improvements.  A generic model can be initially used and replaced later with a more refined, smaller, and cheaper model as more data becomes available.\n\n### Key Takeaway\n\nThe main point is that adding more LLM calls, creating a compound AI system, is a powerful technique often underutilized. This leads to faster, more reliable, and higher-quality AI applications, particularly as LLMs continue to improve and costs decline. ", "url": "https://frontierai.substack.com/p/throw-more-ai-at-your-problems"}, {"title": "A theory of the AI market", "short": "AI market prediction:  Value will accrue to core model providers & application vendors, leaving mid-level infrastructure players in a precarious position.  Enterprises will focus on cost savings through automation in the short term. #AI #ArtificialIntelligence #AIMarket #Prediction", "long": "### The AI Market: A Two-Sided Coin\nThe authors predict a shift in the AI market within the next 1-2 years.  Enterprises will prioritize applications offering demonstrable value, particularly cost savings through automation of tedious tasks.\n\n### Two Paths to AI Value\nTwo approaches will emerge:  Companies with in-house AI expertise will build custom applications, while others will adopt vendor solutions for faster time-to-value and lower costs.\n\n### Application Vendors: Key Players\nApplication vendors focusing on areas like Tier 1 support automation, sales prospecting, and code generation will see significant growth.  Success hinges on clear value measurement, a challenge given the nascent nature of AI metrics.\n\n### A Barbell Distribution of Value\nValue is predicted to concentrate at the market's extremes.  Foundation model providers (OpenAI, Anthropic, Google) will flourish, alongside numerous successful applications at the top of the stack.\n\n### Mid-Level Infrastructure: A Wait-and-See Approach\nMid-level infrastructure providers (data systems, development frameworks) face a less certain future.  The market is immature, and current tools struggle with widespread generalization.  Model inference is a notable exception due to high GPU costs.\n\n### The Long View\nThe authors acknowledge the inherent difficulty in forecasting long-term AI market trends, indicating this analysis covers the short-to-medium term.  They invite readers to challenge their predictions and contribute to a dynamic discussion.", "url": "https://frontierai.substack.com/p/a-theory-of-the-ai-market"}, {"title": "Deep AI work", "short": "Deep, specialized AI products are outpacing broad, general-purpose AI in the market. While integration challenges exist, focusing on specific job functions offers faster ROI & easier adoption. As AI tech advances, customization will improve, making deep AI a strong, scalable solution. #AI #ArtificialIntelligence #DeepLearning #AIproducts", "long": "### Deep vs. Broad AI Products: A Shifting Landscape\n\nThe article explores the evolving landscape of AI-powered products, focusing on the trade-offs between \n'deep' (narrowly focused on specific job functions) and 'broad' (general-purpose) AI applications.\n\n### The Rise of Specialized AI\n\nThe author suggests a growing preference for deep AI products due to faster time-to-value and easier adoption. Customers are increasingly focused on tangible ROI, making specialized solutions more appealing. This is particularly true in the early stages of AI adoption.\n\n### Addressing Integration Challenges\n\nOne potential drawback of deep AI specialization is the need for multiple integrations across various departments. This might appear as a complex setup, but the article argues that it mirrors current organizational structures, and companies already manage numerous separate systems.  The ultimate goal for vendors is to provide a single, consolidated platform to streamline management.\n\n### Long-term Advantages of Depth\n\nThe author predicts long-term benefits for deep AI applications as AI technology develops.  Model customization will become more accessible and efficient, and businesses with extensive data on specific job functions will be better positioned to provide highly personalized and higher-quality results.\n\n### The Simplicity Argument\n\nThe article acknowledges the appeal of broad, general-purpose AI tools that offer simplicity. However, the author counters this by highlighting the complexities of integrating and customizing broad platforms across multiple teams. Focusing on delivering clear, demonstrable value through specialized solutions is presented as a more effective strategy.\n\n### Conclusion: A Balanced Perspective\n\nThe author concludes by emphasizing the rapidly changing AI market, yet remains confident about the viability of deep AI applications in the short to medium term. The long-term success hinges on enterprises recognizing AI's potential for real ROI, and the ability of AI companies to demonstrate scalability and effective customization.", "url": "https://frontierai.substack.com/p/deep-ai-work"}, {"title": "Customers want more AI, not better AI", "short": "In a crowded AI market, focusing on \"more\" AI features, not just \"better\" AI, is key to attracting customers.  New, innovative tools that solve problems in unique ways are more persuasive than subtle quality improvements in a vibes-based evaluation market.  This is a temporary advantage; quality will matter more as the market matures.", "long": "### Focusing on \"More AI\" over \"Better AI\"\n\nThe article argues that in the maturing AI market, focusing on offering more AI-powered features is a more effective strategy than solely emphasizing \"better\" AI.  Current customer evaluations often rely on \"vibes,\" making subtle quality improvements hard to sell.\n\n### The Challenge of Vibes-Based Evaluations\n\nCustomers often make quick evaluations based on limited interactions, making it difficult to showcase superior average quality.  Existing solutions create switching costs, and claims of general superiority are not always convincing.\n\n###  The \"More AI\" Strategy\n\nInstead of focusing on incremental quality improvements, companies should concentrate on developing new AI-driven features. This novelty excites customers, stands out from the competition and helps establish a product's value proposition.\n\n### Addressing Customer Expectations\n\nCustomer trust in AI is often low due to market saturation of \"snake oil\" products. While maintaining quality is key, adding genuinely new features that solve previously unsolvable problems will be more persuasive to customers.\n\n###  Novel Features and Full Job Functions\n\nThe authors advocate for focusing on AI-enabled solutions that serve complete job functions rather than incremental additions. This approach opens avenues beyond chatbots, into data analysis, insight generation, and content creation.\n\n### A Transient Strategy\n\nThe article concludes this approach is context dependent; as the market matures, quality will again become the paramount factor.  Currently, breadth of valuable features is more advantageous.  Finding the balance between speed and quality remains challenging for businesses.", "url": "https://frontierai.substack.com/p/customers-wants-more-ai-not-better"}, {"title": "Should AIs try to be human?", "short": "Should AI aim to be human?  Anthropomorphism in AI products offers engagement but demands sophisticated handling of varied inputs.  Balancing user expectations with current capabilities is key, impacting user experience and product potential.  The future points towards increasingly human-like AIs; the question is when we'll lose the ability to differentiate.", "long": "### Should AI strive for human-like qualities?\n\nThis article explores the question of whether AI products should aim to mimic human behavior.  The authors observe that many AI tools use human-like personas, complete with photos and names, to enhance user interaction. However, they question whether this approach is ultimately beneficial.\n\n### The allure and risks of anthropomorphism\n\nAnthropomorphizing AI can make interaction more appealing, enabling users to easily express their needs.  However, this strategy requires AI systems to handle a wider range of inputs, from informal messaging styles to complex or ambiguous requests.  If this expectation cannot be met, the user experience suffers.\n\n### Balancing expectations\n\nThe article advocates for setting realistic yet ambitious goals for AI product behavior.  While overpromising human-like capabilities and then failing can be detrimental, underselling an AI's potential limits its growth and utility.  The goal should be a balance between user expectations and the AI’s current capabilities.\n\n### RunLLM's approach\n\nThe authors, representing RunLLM, share their own experience.  They currently avoid using anthropomorphic design for their Slackbot, focusing on building efficient workflows and acknowledging a learning curve for users.  However, they foresee a shift towards more human-like AI systems in the future.\n\n### The Future of AI\n\nThe authors predict an increase in human-like AIs, raising the question of when we’ll reach the point where we can no longer distinguish between human and AI interactions. This highlights the importance of careful design and realistic expectations in developing user-friendly AI products.", "url": "https://frontierai.substack.com/p/should-ais-try-to-be-human"}, {"title": "AI companies should be AI-first", "short": "AI companies should lead by example!  Using AI tools internally boosts product design, reveals LLM limitations, sparks creativity, and builds empathy. Stay ahead of the curve by embracing innovation – it's not just about productivity, it's about understanding your users.", "long": "### AI Companies Should Embrace AI Tools\n\nAI companies, despite creating products that transform workflows, often resist AI adoption internally. This article argues that integrating AI tools can significantly benefit these companies. \n\n### Enhanced Product Instincts\n\nExposure to diverse AI products helps develop better product design instincts by understanding successful and unsuccessful design elements.\n\n### Understanding Limitations\n\nUsing various AI tools exposes AI builders to LLM limitations, providing valuable insights into product development boundaries.  Real-world applications reveal challenges earlier in the development process. \n\n### Fostering Creativity\n\nExploring external AI solutions sparks fresh perspectives, potentially leading to more innovative and creative product features and development paths.\n\n### Productivity and Empathy\n\nThe obvious benefit is increased productivity but using these tools fosters empathy, allowing for the creation of better products by understanding users' challenges firsthand.\n\n### Staying Ahead\n\nThe AI landscape is constantly evolving; adopting and testing new tools ensures that you stay on the cutting-edge of technology.\n\n### Overall\n\nThe authors encourage actively experimenting with various AI tools. It's essential to approach tools critically but remain adaptable, leveraging the advantages of new technologies while learning from past experiences.", "url": "https://frontierai.substack.com/p/ai-companies-should-be-ai-first"}, {"title": "AI workers will ignore your Slack messages too", "short": "AI work tools need deep SaaS integration to mimic human context and nuance. Data scoping, access management, and implicit knowledge learning are key challenges for building truly effective AI coworkers.  Better LLMs and APIs could offer future solutions.", "long": "### Modern Knowledge Work Orchestrates Multiple SaaS Services\n\nModern knowledge work involves juggling many SaaS platforms daily. Developers use Slack, GitHub, Linear, and DataDog, while support engineers use Zendesk, Jira, and Slack.  Remote/hybrid work amplified this reliance on digital tools.\n\n### AI Work Products Must Integrate with Existing SaaS\n\nAI-powered tools must integrate bidirectionally with enterprise SaaS stacks.  This goes beyond simple data transfer; AI needs the context and nuance humans possess.\n\n### Data Scoping and Access Management\n\nThe biggest challenge is managing access to different data.  AI needs to understand context; a public Slack question from an executive shouldn't grant full access.\n\n### Data Contextualization and Implicit Learning\n\nAI must filter irrelevant data like outdated plans. Humans implicitly use context and experience—AI needs this capability to avoid false alarms and prioritize tasks effectively.\n\n### Challenges and Future Outlook\n\nThese challenges are significant but not insurmountable.  Building AI-native data management infrastructure might be premature; better LLMs or APIs could offer solutions. The coming years will determine the best approach.", "url": "https://frontierai.substack.com/p/ai-workers-will-ignore-your-slack"}, {"title": "AI products should be built for human coworkers", "short": "AI excels at automating tasks, but edge cases require human intervention.  Design AI products with seamless human integration to handle these cases and ensure smooth customer evaluation & long-term success.  Observe customer tools to integrate efficiently! #AI #automation #humancentereddesign", "long": "### AI Automation and Human Collaboration\nAI's primary benefit is automating tedious tasks, freeing human time and improving key metrics.  However, edge cases will exist where AI needs human intervention.\n\n### Edge Cases and Human Fallback\nAI systems should gracefully handle these situations by seamlessly integrating human input.  Lack of such integration creates risks and hinders enterprise adoption.\n\n### Customer Evaluation and System Success\nCustomers will evaluate AI products by testing edge cases, requiring smooth handling.  Failure to do so will negatively affect the product's success and user perception.\n\n### Human-Centric AI Design\nDesigning for human coworkers involves: detecting edge cases, defining the human-AI interaction, enabling efficient human handoffs and enabling AI learning from human interventions.\n\n### Integration Points and Customer Tools\nAI products should integrate with existing customer tools to enhance efficiency. Observing customer workflow is crucial for successful integration.\n\n### Addressing Criticisms\nWhile AI's potential excites early adopters, some criticisms may be hard to address due to current technological limits.  Focusing on efficient integration and intuitive design remains key.", "url": "https://frontierai.substack.com/p/ai-products-should-be-built-for-human"}, {"title": "The rise of AI work", "short": "AI work is evolving!  Generalist AI tools aim for broad functionality, while specialists target niche expertise. The best approach remains unclear, emphasizing the importance of focused execution and adapting to unexpected opportunities. #AI #LLM #ArtificialIntelligence #FutureOfWork", "long": "### The AI Work Revolution\nThe article discusses the evolving landscape of AI-powered work, moving beyond initial hype.  It posits that successful LLM products will demonstrate real value by automating human tasks. \n\n### The AI Worker Spectrum\nAI products are categorized across a spectrum: generalists aiming to handle various company functions (sales, HR, etc.), specialists focusing on a narrow niche (e.g., technical support), and those occupying the middle ground, automating specific workflows.\n\n### The Broad Approach\nGeneralist AI products offer a holistic company understanding, simplifying sales by targeting a single decision-maker (like a CIO).  However, they lack deep expertise in any one area, risking competition from niche specialists. \n\n### The Niche Approach\nSpecialist AI products offer in-depth expertise and higher quality, handling edge cases effectively, particularly crucial in enterprise settings.  This strength, however, could limit their market reach compared to generalists.\n\n### The Middle Ground\nProducts targeting specific workflows offer a balance between breadth and depth.  They handle multiple related tasks but may not fully automate entire functions, relying on human-AI collaboration. Concerns exist about their long-term market viability without strong differentiation.\n\n### The Verdict\nThe article concludes that there's no single 'best' approach.  Success hinges on making a strategic bet (broad or niche) and steadfastly pursuing it, acknowledging that unforeseen opportunities might arise.", "url": "https://frontierai.substack.com/p/the-rise-of-ai-work"}, {"title": "The future of AI pricing", "short": "AI pricing is shifting from seat-based to work-based models.  This better reflects AI's value in automating tasks, but challenges remain in defining \"work done\" and managing customer expectations.  Work-based pricing is the future of AI, but general-purpose tools like ChatGPT may remain an exception, at least for now.", "long": "### The Future of AI Pricing: From Seats to Work\n\nThe authors, building an AI product (RunLLM), share insights on AI pricing.  They argue that traditional seat-based pricing is unsuitable for AI tools and advocate for work-based pricing.\n\n### Why Work-Based Pricing?\n\nAI tools' value lies in automating tasks, freeing human time for higher-value work.  Seat-based pricing ignores the varying work handled by different users, while work-based pricing directly reflects the value delivered (e.g., questions answered, meetings booked). Unlike traditional software, AI delivers end-to-end work, similar to a consultancy.\n\n### Challenges of Work-Based Pricing\n\nDefining \"work done\" presents a challenge.  For instance, an AI-based sales tool could be priced by meetings booked, held, or closed deals.  Enterprise budget concerns for unpredictable consumption models exist, but tiered usage models (pre-paid usage plus overage) alleviate this.  Determining the actual value of AI work to the customer is crucial; it's not a low-margin, high-volume infrastructure business.\n\n### Exceptions: ChatGPT and Copilot\n\nChatGPT and GitHub Copilot use seat-based pricing due to difficulty in predicting usage and quantifying work done. Their low cost and general-purpose nature make seat-based pricing viable, at least initially.  But, as AI matures, they may shift towards work-based models.\n\n### The Bottom Line\n\nAI pricing is evolving. While work-based pricing is the future, especially for enterprise use, challenges remain in defining \"work\" and managing customer expectations. The authors believe this may lead to more pervasive micro-transactions.", "url": "https://frontierai.substack.com/p/the-future-of-ai-pricing"}, {"title": "Introducing the AI Frontier", "short": "The AI Frontier blog refocuses for year 2!  Deeper dives into building AI products & businesses, less generic AI news.  Expect more insights from RunLLM's experience & new content on key technologies. #AI #LLM #RunLLM #ArtificialIntelligence", "long": "### The AI Frontier's New Direction\n\nThe blog, initially launched to explore the broader landscape of LLMs and generative AI, is transitioning to a more focused approach. This shift comes after a year of experimenting and analyzing audience engagement.\n\n### Refined Focus on Key Areas\n\nThe authors recognize that their most successful posts were those directly related to their hands-on experience building the RunLLM AI product. Consequently, the blog will concentrate on these areas:\n\n*   Lessons from building an AI product and business\n*   The impact of technological advancements on AI startups\n*   Crucial technologies requiring close attention\n\n### Deeper Insights and Less Generic Takes\n\nThis refined focus aims to offer more in-depth analyses and unique perspectives. This approach moves away from simply commenting on trending news to presenting detailed insights directly from experience. The authors are trying to minimize the more generalized and readily available analyses of AI trends.\n\n### New Content Planned\n\nThe authors plan to include new content over the next few months:\n\n*   Examination of established AI wisdom versus practical experience\n*   Showcasing particularly useful or interesting AI projects (including RunLLM)\n*   Detailed lessons from less glamorous aspects of AI development, such as data cleaning.\n\n### Continued Growth and Engagement\n\nWith a community of nearly 2,000 subscribers, the authors express gratitude for the positive reception.  They aim to leverage this foundation to make the blog even more insightful and valuable moving forward. They welcome thoughts and feedback from their readers.", "url": "https://frontierai.substack.com/p/introducing-the-ai-frontier"}, {"title": "In defense of vibes-based evaluations", "short": "RunLLM initially disliked \"vibes-based\" AI evaluations (relying on intuition, not metrics).  But, after many customer interactions, they've found it surprisingly effective for incremental improvement & building trust. While acknowledging the need for better benchmarks, they advocate for combining vibes-based evaluations with rigorous testing for a more holistic assessment of AI quality.", "long": "### Vibes-Based Evaluations in AI\n\nThe authors, from RunLLM, initially disliked the informal \"vibes-based\" approach to evaluating AI response quality. This method relies on intuition and expectation rather than empirical metrics, essentially assessing whether the LLM gave the expected answer.\n\n### Unexpected Benefits\n\nHowever, after numerous customer interactions, they've found unexpected advantages.  Incremental improvements using this approach fosters trust by addressing specific user needs. Real-world requests often reveal out-of-distribution inputs that standard tests sets miss, offering valuable insights. Furthermore, some user feedback (like preference for conciseness or detail) is not easily quantifiable, thus requiring interactive feedback.\n\n### Limitations of Other Evals\n\nThe authors acknowledge the value of metrics but highlight existing limitations.  General-purpose benchmarks like MMLU are too broad; task-specific leaderboards don't directly evaluate individual product performance.  Their own framework (measuring correctness, coherence, conciseness, and relevance) faces challenges in its interpretability. Metrics can be hard to trust due to potential LLM biases in scoring, and it's a considerable effort to create robust test sets that account for the diversity of real-world inputs.\n\n### Pitfalls of Vibes-Based Evals\n\nDespite the benefits, vibes-based evaluations have drawbacks. Initial impressions heavily influence later judgments.  Binary feedback lacks nuance in distinguishing various levels of success or failure.  Poorly formed questions or feedback can easily mislead the AI assistant. \n\n### Combining Approaches\n\nThe authors conclude that a combination is needed.  While improved benchmarks are necessary, direct, interactive experience is crucial for real-world evaluation. The initial \"vibes\" provide vital qualitative feedback that informs the creation of more focused, quantitative metrics.", "url": "https://frontierai.substack.com/p/in-defense-of-vibes-based-evaluations"}, {"title": "DeepSeek V3 and the actual cost of training frontier AI models", "short": "DeepSeek V3, a 37B parameter model, rivals top LLMs on tough benchmarks with surprising cost-efficiency.  Innovations in training & infrastructure significantly reduce compute needs, challenging the narrative of exorbitant frontier model costs.  While open-weight, full data isn't released; its technical report alone is game-changing for future development.", "long": "### DeepSeek V3: A Cost-Effective Frontier Model\n\nDeepSeek AI's recent release of DeepSeek V3, a 37B parameter model trained on 14.8T tokens, outperforms other open-source models on challenging benchmarks like MATH 500, AIME 2024, and Codeforces.  Its impressive performance relative to compute used highlights significant advancements in training efficiency.\n\n### Key Innovations Driving Efficiency\n\nDeepSeek V3 incorporates several innovative techniques to improve learning efficiency: Multi-head latent attention (MLA) minimizes memory usage, multi-token prediction enhances performance, and efficient Mixture of Expert (MoE) architectures optimize compute.  Partial 8-bit native training and custom multi-GPU communication protocols further boost efficiency.\n\n### Re-evaluating the Cost of Frontier Models\n\nThe $5M figure often cited for DeepSeek V3's final training run is misleading.  The actual cost includes extensive prior research, experimentation, and a large team of 139 technical authors. The true cost per year would likely be far higher than what’s been reported by the media. However,  DeepSeek's transparency and success show the possibility of training similarly performant models at lower costs in the coming years.\n\n### Open-Source Implications\n\nWhile DeepSeek V3's weights are open-source, the full data and code are not publicly available.  This limits the speed of adoption and lowers the direct cost-saving benefits.  Nevertheless, the model's technical report offers valuable insight to accelerate progress within the broader AI community.", "url": "https://www.interconnects.ai/p/deepseek-v3-and-the-actual-cost-of"}, {"title": "(Voiceover) DeepSeek V3 and the actual cost of training frontier AI models", "short": "DeepSeek V3 shatters the myth of million-dollar AI model training!  Learn why a single training run's cost is misleading & what REALLY factors into the price tag of frontier AI. #AI #DeepLearning #MachineLearning #DeepSeek #CostOfAI", "long": "### DeepSeek V3: Efficiency and Cost\nDeepSeek V3, a frontier AI model, demonstrates impressive learning efficiency.  This contrasts with the common misconception that such models necessitate exorbitant training costs, often cited as millions of dollars.  The article counters this perception, highlighting that the true cost depends on numerous factors beyond a single training run.\n\n### Compute Transparency\nThe author emphasizes the need for more transparency regarding the computational resources used in training.  They stress that published figures might not reflect the complete picture, including optimization strategies and resource reuse across multiple projects.  This lack of openness makes it difficult to accurately assess the actual cost.\n\n### Cost Factors Beyond Training Runs\nThe total cost of developing and deploying a frontier AI model involves expenses beyond the single training run.  This includes the cost of hardware, personnel (researchers, engineers), data acquisition and preprocessing, model testing, and ongoing maintenance. A single $5 million training run does not encompass these additional significant costs.\n\n### Benchmarking DeepSeek V3\nThe article includes benchmarking results for DeepSeek V3, showcasing its capabilities. These results help to put the discussion on cost into a more objective perspective, illustrating performance relative to other existing models. The efficiency gains achieved may offset higher upfront costs.\n\n### Conclusion\nThe article concludes that judging the cost of frontier AI models solely based on the expense of a single training run is misleading. A holistic view that accounts for all associated costs provides a more accurate reflection of the financial investment involved in building and maintaining cutting-edge AI technologies.  Openness and transparency in reporting computational resource utilization is vital for better understanding the actual cost.", "url": "https://www.interconnects.ai/p/voiceover-deepseek-v3-and-the-actual"}, {"title": "The state of post-training in 2025", "short": "Post-training in AI is booming!  Costs are rising, but AI-driven feedback is replacing human data, unlocking advanced reasoning models. Get the details in my latest post! #AI #PostTraining #MachineLearning #LLMs #Reasoning", "long": "### Post-training is more impactful than ever\nThe effectiveness of post-training techniques in enhancing model performance has significantly increased since 2024, surpassing previous expectations.  While not a complete solution for advanced reasoning, post-training has become a crucial step.\n\n### Post-training costs are rising\nThe financial investment required for post-training is escalating, driven by the rising demand for large data sets, advanced synthetic data generation, and increasingly complex loss functions. The overall compute costs are becoming substantial, even exceeding $1M for large-scale projects.\n\n### Reduced reliance on human data\nAI's role in post-training is growing, enabling the replacement of human feedback in many aspects. AI feedback is becoming a cost-effective alternative to human data annotation, making post-training more efficient and scalable.\n\n### Post-training unlocks advanced reasoning\nPost-training methods are essential to building advanced reasoning models, as evidenced by OpenAI's o1 models. The infrastructure for post-training is often similar to large-scale RL training, creating a pathway for building highly sophisticated models.\n\n### Open replications of advanced models are on the horizon\nWith the progress made in efficiency and understanding, there is growing optimism for open-source replications of advanced models like OpenAI's o1.  This progress is likely to involve scaling post-training techniques rather than focusing solely on extensive pretraining.", "url": "https://www.interconnects.ai/p/the-state-of-post-training-2025"}, {"title": "Quick recap on the state of reasoning", "short": "New year, new AI!  Reasoning in Language Models is evolving fast. OpenAI's O1 & RFT API are game-changers, using large-scale RL to improve inference & reasoning. Community replications show promise, but lack OpenAI's scale. Focus is shifting to verifiable outcomes & advanced grader models. #AI #LLMs #Reasoning #OpenAI #ReinforcementLearning", "long": "### Reasoning in Language Models: A 2025 Perspective\n\nThis article explores the evolving understanding of reasoning in Language Models (LMs), particularly in light of OpenAI's advancements.  The author clarifies that reasoning in LMs isn't necessarily identical to human reasoning, emphasizing the stochastic nature of these models.  They introduce the concept of \"Reasoning Language Models\" (RLMs), highlighting the importance of evaluating their performance based on verifiable outcomes rather than focusing solely on the processes.\n\n### OpenAI's O1 and Reinforcement Fine-Tuning (RFT)\n\nThe author discusses OpenAI's O1 series of models, trained using large-scale reinforcement learning (RL). This training approach, unlike previous post-training methods, significantly enhances inference-time compute and reasoning capabilities.  The recent release of OpenAI's RFT API allows developers to leverage this infrastructure, enabling the fine-tuning of models for specific tasks with minimal labeled data.\n\n### Community Replication and Reinforcement Learning (RL)\n\nThe article acknowledges the work of researchers replicating or extending O1's capabilities. The author highlights that, while impressive, these replications often lack the scale of OpenAI's infrastructure.  The core principle involves RL, where the model receives reward bonuses for correct answers, thus reinforcing desired behaviors. A research project by the author is mentioned as an example of this successful application of RL.\n\n### Data Formats and Grader Models\n\nThe discussion shifts towards data formats and the role of grader models in evaluating the reasoning capabilities of LMs.  The author contrasts the RFT API's data format with previous training methods. They also explore the complexity of creating suitable grader models for more challenging tasks. It emphasizes that OpenAI's approach shows progress, but also the need to develop more sophisticated reward-shaping techniques in the future.", "url": "https://www.interconnects.ai/p/the-state-of-reasoning"}, {"title": "2024 Interconnects year in review", "short": "2024: AI's year of reasoning! OpenAI's o1 model changed everything, shifting focus to RLMs. Interconnects grew to 20K subs, focusing on RL/post-training, open-source AI policy, and new models.  Open-source AI is changing, and 2025 promises more exciting developments. #AI #OpenAI #RLM #OpenSourceAI", "long": "### 2024 in Review: AI Remains Center Stage\n\nThe year 2024 continued AI's dominance in technological advancements, following the breakthroughs of 2022 (Stable Diffusion, ChatGPT) and 2023 (GPT-4, significant funding).  The most impactful event of 2024 was arguably OpenAI's launch of the o1 model, signaling a shift in model training and usage paradigms.\n\n### OpenAI's o1 and the Future of Reasoning\n\nThe o1 model marked a significant change, moving beyond chat interfaces towards a new era of reasoning language models (RLMs). This paradigm shift is expected to lead to rapid advancements in 2025.\n\n### Interconnects' Growth and Focus\n\nInterconnects experienced substantial growth in 2024, reaching 20,000 subscribers and 1.2 million page views. The publication focused on three key areas: reinforcement learning (RL) and post-training, open-source AI and policy impacts, and new model releases.\n\n### Open-Source AI: A Changing Landscape\n\nThe open-source AI landscape evolved significantly. While initially offering a path to rapid market share, increasing costs prompted many companies to adopt more restrictive licensing.  China's emergence as a significant player in open-source AI was another notable development.\n\n### Key Insights and Future Plans\n\nPost-training and RLHF continued their rise in importance.  Interconnects' analysis on these subjects has even influenced policy discussions. The author expresses optimism for 2025, with plans to further explore reasoning models and expand ongoing projects.", "url": "https://www.interconnects.ai/p/2024-interconnects-year-in-review"}, {"title": "(Voiceover) 2024 Interconnects year in review", "short": "2024 AI in review! Voiceover podcast summarizing 2 years of weekly Interconnects insights. Hear from ML researcher Nathan Lambert on key trends & breakthroughs, available across all major podcast platforms. #AI #ArtificialIntelligence #Podcast #YearInReview #ML", "long": "### Voiceover Podcast: 2024 Interconnects Year in Review\nThis podcast summarizes two years of weekly AI analysis from Interconnects.  It's a voiceover of the original article, offering a convenient way to consume the information.\n\n### Key Themes Explored\nThe podcast delves into significant AI developments and trends from 2024, providing insights into the evolution of AI research, products, and the broader technological landscape. Expect discussions of cutting-edge concepts and the challenges faced in the field.\n\n### Author's Expertise\nThe podcast is presented by Nathan Lambert, an ML researcher with a PhD from Berkeley and experience at Meta, DeepMind, and HuggingFace.  This adds credibility and depth to the analysis presented.\n\n### Target Audience\nThe content is tailored for engineers, researchers, and investors interested in staying informed about AI advancements. It aims to deliver high-level analysis of complex topics without overwhelming technical details.\n\n### Podcast Access\nThe podcast is available via various platforms including the Substack app, Apple Podcasts, Spotify, YouTube, Overcast, and Pocket Casts, ensuring accessibility across different devices and preferences.\n\n### Related Links\nThe podcast also references other resources, namely a detailed written version of the 2024 review and relevant articles from the publication's archive, allowing for deeper dives into specific areas of interest.  The accompanying blog post contains additional visuals for a broader perspective.\n\n### Key Takeaway\nThis podcast provides a concise and accessible overview of major AI trends in 2024, ideal for listeners seeking a quick yet insightful understanding of the field's developments.", "url": "https://www.interconnects.ai/p/voiceover-2024-interconnects-year"}, {"title": "OpenAI's o3: The grand finale of AI in 2024", "short": "OpenAI's o3 model is a HUGE leap forward in AI reasoning!  It smashes benchmarks, including the ARC AGI prize, with surprisingly simple methods (no tree search!).  This means rapid progress across the entire AI ecosystem is coming soon. #AI #OpenAI #o3 #Reasoning #AGI", "long": "### OpenAI's o3 Model: A Breakthrough in AI Reasoning\n\nOpenAI's newly previewed o3 model marks a significant leap in AI reasoning capabilities, exceeding expectations and surpassing previous state-of-the-art models.  It's a faster, more impactful follow-up to the o1 model.\n\n###  Superior Performance Across Benchmarks\n\no3 demonstrates a step-change in performance across various benchmarks. It surpasses the 85% threshold for completing the ARC AGI prize, significantly improved scores on the Frontier Math benchmark, and achieved substantial improvements on leading coding benchmarks like SWE-Bench-Verified and Codeforces.\n\n###  Inference Cost and Architecture\n\nWhile initially speculated to use tree search, o3 appears to be a model trained with RL, utilizing a consensus approach for improved results.  High-compute configurations show remarkably high cost,  but lower-cost versions like o3-mini will soon be publicly available and will likely be widely adopted.\n\n###  Implications for the Future of AI\n\nThe rapid progress demonstrated by o3 suggests a new era of advancements in AI research and development. The enhanced reasoning capabilities will accelerate progress in various fields and bring about a significant change in software engineering roles, though challenges remain.  o3 is not a perfect solution to all problems, but its potential is undeniable.\n\n###  A New Era of Reasoning-Based LMs\n\nThe success of o3 strengthens the significance of reasoning-based language models, which are poised to become a standard tool in the AI arsenal for the coming years. This new paradigm requires further research and exploration, particularly in understanding the full implications of large-scale RL training and its role in achieving higher levels of AI capabilities.", "url": "https://www.interconnects.ai/p/openais-o3-the-2024-finale-of-ai"}, {"title": "(Voiceover) OpenAI's o3: The grand finale of AI in 2024", "short": "OpenAI's o3 is a game-changer in AI!  Comparable to GPT-4, o3 excels in reasoning & problem-solving.  It conquers the ARC benchmark, showing huge potential.  The architecture's discussed, revealing no tree search.  2024 sees RL's comeback, central to o3's impressive abilities. #OpenAI #AI #o3 #Reasoning #ReinforcementLearning", "long": "### OpenAI's o3: A New Era of AI\n\nOpenAI's release of o3 signifies a major advancement in AI, comparable to the impact of GPT-4.  This new model excels in reasoning, a crucial aspect currently driving AI innovation.  The focus is on reasoning language models, representing the forefront of current and future AI capabilities. \n\n### o3 Overview and ARC\n\no3's capabilities are highlighted by its success in tackling the challenging Abstraction and Reasoning Corpus (ARC) benchmark, demonstrating significant progress in abstract reasoning abilities.  This success showcases o3's potential for complex problem-solving beyond traditional language tasks. \n\n### Architecture, Cost, and Training\n\nThe article delves into o3's architecture, training process, and resource requirements.  A key takeaway is the continued absence of tree search algorithms in the model's design.  Understanding the cost of training is crucial for evaluating the scalability and accessibility of such advanced AI models. \n\n### 2024: RL Returns\n\nThe year 2024 witnessed a resurgence of Reinforcement Learning (RL) in AI development, as evidenced by o3.  RL techniques played a significant role in o3's development, shaping its capabilities and further emphasizing the importance of RL in pushing the boundaries of AI.", "url": "https://www.interconnects.ai/p/voiceover-openais-o3-the-grand-finale"}, {"title": "The AI agent spectrum", "short": "AI agents need clearer definitions! This article proposes a spectrum of complexity from simple tool-using language models to fully autonomous agents interacting with our digital lives.  It also presents a framework focusing on utility, information flow, and future agent behavior. #AIagents #ArtificialIntelligence #ML", "long": "### AI Agent Spectrum: A Clearer Definition\n\nThe article emphasizes the need for clearer definitions and examples of AI agents to facilitate market growth.  Current definitions are too broad, often linking all agents to reinforcement learning (RL), creating confusion.\n\n### Types of AI Agents\n\nA spectrum of AI agent complexity is proposed:\n\n1.  **Basic:** Single language models using single tools (e.g., search-based chatbots).\n2.  **Intermediate:** Single language models with multiple tools (e.g., ChatGPT plugins).\n3.  **Advanced:** Multiple language models for a single task, possibly with tools.\n4.  **Complex:** Multiple model calls within loops for extended operation.\n5.  **Highly Complex:** Agents with open access to systems beyond structured APIs.\n6.  **Future:** Agents operating beyond a single computer.\n\n### Beyond Reinforcement Learning\n\nThe author argues that the focus on RL is outdated; many agents function through simple autonomy.  The spectrum progresses from tool-use language models, to orchestration language models, and finally to fully agentic models capable of handling open-ended tasks.\n\n### Framework for Understanding Agents\n\nA framework focuses on feedback application and information processing.  The four key aspects are:\n\n1.  **Scoping the Horizon:** Agent runtime and planning.\n2.  **Defining Utility:** How the agent succeeds or fails.\n3.  **Pruning Information:** How the agent interacts with information.\n4.  **Interacting with Agents:** Agent-to-agent interaction.\n\n### Open Questions\n\nThe article concludes with open questions on online language model training, inter-agent interaction, and managing open-ended vs. closed agents.", "url": "https://www.interconnects.ai/p/the-ai-agent-spectrum"}, {"title": "(Voiceover) The AI agent spectrum", "short": "AI agents are evolving rapidly! This podcast explores the diverse spectrum of AI agents, from simple to complex, tracing their history and highlighting key questions about their future.  Listen now to navigate the AI agent landscape and learn what's next!", "long": "### Voiceover Introduction\nThis podcast episode, a voiceover version of the original article \"The AI Agent Spectrum,\" explores the evolution and categorization of AI agents.  It traces the history of reinforcement learning and its impact on the development of diverse AI agent types.\n\n### Agent Cartography\nThe main focus lies in creating a comprehensive map or \"cartography\" of the AI agent landscape. The episode delves into the various classes of AI agents, differentiating them based on their capabilities and functionalities. This section likely includes descriptions of different agent types, their underlying principles, and potential applications.\n\n### Future Questions\nThe podcast concludes by posing key questions about the future of AI agents. These open-ended questions likely focus on the challenges and opportunities associated with advanced AI agents, covering topics such as scalability, robustness, ethics, and societal impact. The questions aim to stimulate further thought and discussion on the trajectory of AI agent development.  The original article likely includes a visual representation of the agent spectrum.\n\n### Additional Information\nThe audio includes timestamps for easy navigation to specific chapters.  Listeners can also access the full article online for detailed information and visual aids.", "url": "https://www.interconnects.ai/p/voiceover-the-ai-agent-spectrum"}, {"title": "OpenAI's Reinforcement Finetuning and RL for the masses", "short": "OpenAI's new Reinforcement Finetuning API makes RL accessible to everyone! This game-changing technology improves model performance with minimal data, boosts RL stability, and could significantly impact future language models.  Check it out!", "long": "### OpenAI's Reinforcement Finetuning (RFT) API\nOpenAI's new RFT API is a game changer, making Reinforcement Learning (RL) accessible to a wider audience.  It allows finetuning of various OpenAI models, focusing on improving model performance by reinforcing positive behaviors through repeated training on a small dataset.\n\n### Impact on RL and Language Models\nRFT's arrival signals a significant leap for RL, addressing its historical instability issues and making it more practical for broader adoption.  Open-source efforts like Allen AI's Open Instruct offer similar functionality.  This API could create a data flywheel for advanced reasoning models, and dramatically expands the scope of RL's application in language model training.\n\n### How RFT works\nRFT leverages 'grader' configurations to provide reward functions that help models learn from limited data by iterating through prompts and answers.  This method of iteratively reinforcing behaviors improves model responses. This is more efficient than traditional methods for instruction tuning.\n\n### Key Improvements and Future Trends\nRFT's stability hints at future advancements in RL for language models and other similar systems. It moves RL beyond a niche field to a more fundamental component of AI development.  With the power of this API, the future could see less emphasis on supervised finetuning, instead shifting towards primarily self-supervised learning with RFT as a crucial post-training method.", "url": "https://www.interconnects.ai/p/openais-reinforcement-finetuning"}, {"title": "(Voiceover) OpenAI's Reinforcement Finetuning and RL for the masses", "short": "OpenAI's reinforcement finetuning: the final piece of Yann LeCun's AI vision!  This podcast explores its impact, implementation, and how it's making RL accessible to everyone. #AI #ReinforcementLearning #OpenAI #MachineLearning", "long": "### OpenAI's Reinforcement Finetuning\nThis podcast discusses OpenAI's reinforcement finetuning, a significant advancement in AI.  It's described as the final piece to complete Yann LeCun's vision for AI.\n\n### Impact and Implementation\nThe podcast explores the far-reaching implications of this technology.  It speculates on how the finetuning process is likely implemented and raises questions on the method's efficiency.  Hypotheses are presented about its inner workings, and how it has improved AI.\n\n### Accessibility of Reinforcement Learning\nThe discussion highlights the democratization of reinforcement learning (RL), making it more accessible to a wider audience.  This makes AI technology more accessible to the average individual.\n\n### Related Figures\nThe podcast includes references to several key figures and resources: Yann LeCun's vision, grader configuration details, and reinforcement learning curves. These figures provide key insights into the technical aspects of the topic.  The accompanying images illustrate concepts and data related to reinforcement learning. \n\n### Overall\nThis podcast offers a high-level overview of OpenAI's reinforcement finetuning, emphasizing its impact and accessibility.  The podcast covers both the high-level conceptualization and touches on the technical implementation details for those who have a better understanding of AI. ", "url": "https://www.interconnects.ai/p/voiceover-openais-reinforcement-finetuning"}, {"title": "Interviewing Finbarr Timbers on the \"We are So Back\" Era of Reinforcement Learning", "short": "Reinforcement learning (RL) is back!  From Atari to AlphaZero to OpenAI's O1, this interview explores RL's history, challenges (reward modeling, exploration), and exciting future with LLMs.  Listen now to understand the 'we're so back' era of RL and build your AI career.", "long": "### Reinforcement Learning: A Revisit\nReinforcement learning (RL) is defined as sequential decision-making under uncertainty, involving an exploration-exploitation trade-off.  The author highlights the crucial aspect of discovering new knowledge from a blank slate, contrasting it with supervised learning.\n\n### Deep RL Breakthroughs\nThe article traces the evolution of deep RL, marking key phases: deep RL fundamentals (pre-2016), major projects like AlphaGo and AlphaZero (2016-2018), a subsequent slowdown, and the recent resurgence fueled by RLHF and OpenAI's O1 (2022-present).\n\n### Modern RL Applications\nThe discussion covers RL's role in various applications, including RLHF (Reinforcement Learning from Human Feedback) for fine-tuning language models and OpenAI's O1, which introduces large-scale RL for more open-ended language model behavior.\n\n### Critiques and Bottlenecks\nThe article acknowledges critiques of RL, such as its difficulty in real-world applications.  Reward modeling is pinpointed as a major bottleneck, emphasizing the challenges in creating robust and effective reward functions.  Exploration, in complex environments like video games, is also cited as a significant hurdle.\n\n### Future of RL\nThe author speculates on the future of RL, suggesting that  combining reinforcement learning with Large Language Models (LLMs) holds significant promise. The exploration-exploitation trade-off remains a key challenge. The article concludes with reflections on team management in the context of large-scale RL projects and the value of personal branding for career advancement in AI.", "url": "https://www.interconnects.ai/p/finbarr-timbers"}, {"title": "OpenAI's o1 using \"search\" was a PSYOP", "short": "OpenAI's o1 doesn't use search during inference; it's a sophisticated RL system. The apparent controlled compute is from sampling many generations, not search.  Data efficiency comes from verifiable answers and LLM-generated continuations. RL acts as implicit search, following Rich Sutton's Bitter Lesson. Future posts will explore reproducing o1 and other related models.", "long": "### OpenAI's o1: A Chain of Thought, Not Search\n\nThe author challenges the prevailing belief that OpenAI's o1 model uses search during both training and inference.  They argue it relies primarily on large-scale reinforcement learning (RL) without intermediate rewards or search algorithms like AlphaZero.\n\n### Controlled Compute, Not Explicit Search\n\nThe article analyzes OpenAI's published compute plots. The author proposes that the apparent control over test-time compute isn't from search, but from sampling multiple generations per prompt and plotting the results. This creates the illusion of controllable inference, without actual search.\n\n### Training Data: Verifications and Continuations\n\nThe success of o1 hinges on the structure and quality of its training data.  The author posits that o1's data efficiency stems from focusing on prompts with verifiable answers (math problems, code, etc.) and using LLMs to provide continuations when the model falters during the RL process.\n\n### RL as a Form of Search\n\nThe article concludes that o1's RL training acts as a type of search implicitly, exploring possible reasoning paths to maximize rewards. By emphasizing training data and long-running RL, OpenAI scaled computation without explicit search, aligning with Rich Sutton's 'Bitter Lesson'.\n\n### Future Directions\n\nThe author plans future posts to delve deeper into the o1 model, including reproducibility, the existing literature, and how open-source models might differ.", "url": "https://www.interconnects.ai/p/openais-o1-using-search-was-a-psyop"}, {"title": "(Voiceover) OpenAI's o1 using \"search\" was a PSYOP", "short": "OpenAI's o1 models aren't as revolutionary as they seem!  New analysis reveals their 'search' function may be a PSYOP, highlighting the need for critical evaluation of AI capabilities.  #AI #OpenAI #LLMs #ArtificialIntelligence", "long": "### OpenAI's o1 Models: A Chain of Thought\n\nThis article delves into OpenAI's o1 models, explaining them as a complex chain of thought.  The author challenges the perception of these models, suggesting they are not as sophisticated as initially portrayed.\n\n###  The \"Search\" Functionality: A PSYOP?\n\nThe article questions the efficacy of the \"search\" feature in OpenAI's o1 models, suggesting it might be misleading or a form of disinformation. It implies that the models' performance relies on less sophisticated mechanisms than their apparent capabilities might suggest.\n\n### Understanding the Model's Limitations\n\nThe analysis emphasizes the need for understanding the limitations and potential biases of OpenAI's o1 models. It encourages critical thinking about claims surrounding AI advancements and the importance of comprehending how AI systems really function.\n\n###  Visualizations and Data\n\nSeveral figures and data visualizations accompany the article's explanation, supporting the analysis and providing further insights into OpenAI's o1 models and how their internal workings affect their external performance.\n\n###  Call to Critical Evaluation\n\nThe overall message advocates for a more critical evaluation of claims in the field of AI, emphasizing the importance of understanding models' limitations rather than accepting outward appearances of sophistication at face value.", "url": "https://www.interconnects.ai/p/voiceover-openais-o1-using-search"}, {"title": "OLMo 2 and building effective teams for training language models", "short": "Ai2 releases OLMo 2 (7B & 13B parameters) open-source language models, outperforming competitors!  Article highlights building effective training teams: detail-oriented researchers, insightful managers, & sustained effort.  Get OLMo 2 on HuggingFace & Ai2's playground!", "long": "### OLMo 2 Released\n\nOLMo 2, a new series of open-source language models with 7B and 13B parameters, has been released by Ai2.  These models outperform competitors in their parameter class on several benchmarks.\n\n### Effective Language Model Training Teams\n\nThe article emphasizes the importance of building effective teams for successful language model training.  Key elements include detail-oriented technical contributors capable of handling intricate issues, technical managers able to manage complex information and prioritize effectively, and consistent effort over time fueled by passion for the project.\n\n### Team Structure and Culture\n\nThe author, drawing from experience at Ai2, contrasts their smaller teams (around 20 people for Tülu 3) with much larger teams at major tech companies (200 people for a similar post-training effort at Meta).  Despite the scale difference, the need for deep technical ownership and relentless prioritization is common to successful training.   The author highlights the importance of valuing impact over personal interest.\n\n### OLMo 2 Performance\n\nOLMo 2 Instruct surpasses Llama 3.1 8B Instruct and Qwen 2.5 Instruct on Ai2's evaluation suite. The training included 4 trillion (7B) and 5 trillion (13B) tokens, respectively.  The models are available on HuggingFace and Ai2's playground.\n\n### Key Learning\n\nMultiple seeds are crucial for stable Reinforcement Learning (RL) finetuning.  Even small improvements accumulated over time significantly improve performance.", "url": "https://www.interconnects.ai/p/olmo-2-and-building-language-model-training"}, {"title": "(Voiceover) OLMo 2 and building effective teams for training language models", "short": "OLMo 2 is here!  Learn about this groundbreaking open-source language model & how to build effective teams for LLM training.  Get the demo, artifacts, and more: [link to article] #LLM #AI #OpenSource #OLMo2", "long": "### Announcing OLMo 2\n\nThe article announces the release of OLMo 2, highlighting it as a significant advancement in open-source language models.  It emphasizes the model's superior performance compared to its predecessors.\n\n### Building Effective Language Model Training Teams\n\nThe author shares insights gained from building and managing teams focused on training large language models (LLMs). This includes practical advice and lessons learned on team structure, efficiency, and collaboration.\n\n### Accessing OLMo 2 Resources\n\nConveniently accessible links are provided to access OLMo 2's resources.  Users can find the demo, artifacts, and relevant research materials to aid in understanding and using the model, promoting immediate engagement and further exploration.\n\n### Practical Applications of OLMo 2\n\nWhile not explicitly stated, the article implicitly suggests OLMo 2's potential use in various applications where effective language models are needed.  Its open-source nature implies accessibility for both researchers and developers to build upon this innovative model.\n\n### Future Directions\n\nAlthough not directly addressed, the article sets the stage for future developments by showcasing OLMo 2 as a promising foundation for further research and improvements in the open-source LLM space.", "url": "https://www.interconnects.ai/p/voiceover-olmo-2-and-building-effective"}, {"title": "Tülu 3: The next era in open post-training", "short": "Tülu 3, the 1st fully open recipe for frontier model post-training, is here!  We surpassed Meta's Llama 3.1 instruction-tuned models using novel techniques like on-policy data generation & Reinforcement Learning w/ Verifiable Rewards (RLVR).  Get the code & models: [link to GitHub] #LLMs #OpenSource #AITraining", "long": "### Tülu 3: Open-Source Frontier Model Post-Training\n\nThe article discusses the evolution of open-source post-training techniques for large language models (LLMs).  It highlights the initial excitement surrounding models like Alpaca, Vicuna, and Dolly, which used limited human data and synthetic data for fine-tuning. However, this era was followed by skepticism about the necessity of Reinforcement Learning from Human Feedback (RLHF).\n\n### The Rise of Direct Preference Optimization (DPO)\n\nThe article then describes the shift towards Direct Preference Optimization (DPO) as a more efficient alternative to RLHF.  Models like Zephyr-Beta and Tulu 2 demonstrated DPO's potential.  However, even DPO faced limitations due to resource constraints in the open-source community.\n\n### Tulu 3: A Breakthrough\n\nThis article introduces Tulu 3, a new open-source post-training recipe.  Utilizing Llama 3.1 models, Tulu 3 surpasses the performance of Meta's instruction-tuned versions. Key innovations include: scaling preference data, using on-policy data generation, and introducing Reinforcement Learning with Verifiable Rewards (RLVR) to improve specific skills.\n\n### Open-Sourcing the Recipe\n\nAll the details and code are open-sourced, enabling anyone to fine-tune Llama 3.1 models.  The author expresses excitement about the implications for future language model training, where the lines between pre-training and post-training are blurring.\n\n### The Future of Post-Training\n\nThe article concludes by emphasizing the increasing importance of post-training techniques for leading AI labs and the broader AI ecosystem, including policymakers. Future work will focus on applying Tulu 3 to more models and exploring its synergy with other training methods.", "url": "https://www.interconnects.ai/p/tulu-3"}, {"title": "(Voiceover) Tülu 3: The next era in open post-training", "short": "Tülu 3: Open-source post-training for frontier LLMs is here!  Simplified workflow, amazing results.  Revolutionizing AI development. #Tulu3 #OpenSource #LLMs #AI #PostTraining", "long": "### Tülu 3: Open-Source Post-Training Revolution\n\nThis article discusses Tülu 3, an open-source tool for post-training large language models.  Post-training, the process of fine-tuning pre-trained models, is crucial for adapting them to specific tasks. Tülu 3 aims to simplify and enhance this process. \n\n### Open-Source Accessibility\n\nTülu 3's open-source nature makes it accessible to a wider community of researchers and developers. This fosters collaboration and accelerates innovation in the field. The open nature allows for transparency and community-driven improvements.\n\n### Frontier Model Applicability\n\nTülu 3 is designed to work with frontier models, the most advanced and powerful language models available.  This allows users to leverage the capabilities of these models for their own applications, even without extensive resources.\n\n### Simplified Post-Training Workflow\n\nThe article highlights Tülu 3's user-friendly design, making the complex process of post-training more manageable. This lowers the barrier to entry for those without deep expertise in machine learning. The simplified workflow speeds up the development lifecycle.\n\n### Promising Results and Future Potential\n\nThe article showcases encouraging results obtained using Tülu 3. These results indicate the effectiveness and efficiency of the tool.  The authors express confidence that Tülu 3 will become an important component for developing advanced AI applications. The project's open nature ensures ongoing development and improvement.\n\n### Resources and Links\n\nThe article includes links to additional resources such as Hugging Face for more information on the technical details and results of Tülu 3. These resources are valuable for users interested in learning more and replicating the work.\n\n### Conclusion\n\nTülu 3 presents a significant step forward in open-source post-training for large language models, making powerful technology more accessible and accelerating innovation in the AI field.", "url": "https://www.interconnects.ai/p/voiceover-tulu-3-the-next-era-in"}, {"title": "Scaling realities", "short": "AI scaling still works, but user-perceived improvements are slowing, leading to economic uncertainty.  OpenAI's AGI hype is misleading, as true AGI likely won't be a single, mind-blowing model but a complex system. Despite this, the potential for AI innovation remains enormous, and more specialized models are the future.", "long": "### Scaling Still Works, But the Hype Is Over\n\nThe author discusses the conflicting narratives surrounding AI scaling.  Recent reports suggest that improvements in large language models (LLMs) are slowing, despite continued investment in scaling up model size and training compute. \n\n### Scaling Laws Remain Valid\n\nTechnologically, scaling laws still hold true. Increasing compute power continues to improve model performance as measured by test loss. However, this improvement isn't always directly translatable to user-perceived performance.  The focus on chat-based tasks might be obscuring the real progress.\n\n### User-Perceived Improvements Are Slowing\n\nThe visible improvement for average users is indeed slowing down.  The jump from GPT-3.5 to GPT-4 was significant, but further advancements may not be as easily noticeable to the average user. This raises questions about the economic viability of continuing to scale models for primarily chat applications.\n\n### The AGI Misconception\n\nOpenAI's messaging around impending AGI has created unrealistic expectations.  True AGI, in the author's view, won't necessarily manifest as a vastly improved chat model, but as a more complex system using LLMs as just one component.  This system could involve agents interacting on the web in entirely new ways. \n\n### The Future of AI is Bright\n\nDespite the plateauing of user-perceived progress in chatbots, the author is optimistic.  There is still a massive potential for building diverse AI products, particularly through more specialized models and techniques like post-training. Economic considerations will influence future investments, but the overall trajectory of AI development remains positive. ", "url": "https://www.interconnects.ai/p/scaling-realities"}, {"title": "The Promise of Generalist Robotic Policies", "short": "Self-improving robots are on the horizon!  Combining internet-scale AI training with real-world robot data creates a powerful \"data flywheel.\"  This approach, already showing promising results in simple tasks, could lead to robots capable of understanding and acting in complex environments, even surpassing human abilities. #AI #Robotics #MachineLearning #SelfImprovingRobots", "long": "### The Promise of Generalist Robotic Policies\n\nThis article discusses the potential of creating self-improving robots.  The author describes a live demo where a robot, using a combination of image synthesis and learned policies, successfully places a watch on a towel, demonstrating progress in language-driven robotic control.  Key to achieving this is the use of robotic foundation models.\n\n### Data for Robot Training\n\nThe article explores different data sources for training such models: simulation, YouTube, and real-world robot data.  The author argues that real-world data, while initially seeming impractical due to the scale required, will become the most valuable source once robots are deployed at scale.  The vast amount of experience generated by deployed robots will surpass data from other sources.\n\n### Bridging the Gap\n\nTwo key aspects are highlighted: Internet-scale pretraining to provide semantic understanding and cross-embodiment finetuning to transfer this understanding to the physical world.  The author presents methods like reframing manipulation problems for VLMs and using synthetic examples to elicit problem-solving skills as ways to make this transfer efficient.\n\n### Self-Improvement and Feedback\n\nThe article emphasizes the importance of natural supervision for robot learning. This could come from user interaction and feedback, using natural language to correct robot behaviors.  Reinforcement learning is also key for autonomous self-improvement, allowing robots to learn from the outcomes of their actions and improve generalist policies.\n\n### Towards Physical Intelligence\n\nThe author concludes that the data flywheel, generated by deployed robots, has the potential to create AI systems with true physical intelligence, exceeding data obtainable from the web. While many challenges remain, the combination of Internet-scale pretraining and real-world robot data offers a promising path towards truly capable, self-improving robotic systems.", "url": "https://sergeylevine.substack.com/p/the-promise-of-generalist-robotic"}, {"title": "The Evolving Landscape of LLM Evaluation", "short": "LLM evaluation benchmarks are failing to keep up with rapid model advancements.  Memorization and overfitting to public datasets are major issues.  User-centric evaluations, while imperfect, offer a more realistic, albeit limited, assessment of LLM capabilities. The future of LLM evaluation requires tailored, dynamic, human-designed benchmarks.", "long": "### The Benchmark Crisis in LLM Evaluation\n\nLarge language model (LLM) capabilities have rapidly surpassed existing evaluation benchmarks, leading to a crisis in reliable assessment.  Standard benchmarks like MMLU, GMS8k, and HumanEval are now questioned due to model memorization and overfitting.\n\n### Memorization and Data Leakage\n\nLLMs often train on publicly available data, including benchmark datasets. This leads to memorization of test examples, inflating performance scores and providing unrealistic views of true capabilities.  Mitigating memorization involves encrypting datasets and scanning for contamination.\n\n### Overfitting to Benchmarks\n\nHigh-stakes competition within the LLM field results in overfitting to specific benchmarks.  Models may optimize for these metrics, neglecting overall capabilities.  Synthetic training data, biased towards specific benchmark styles, can produce misleading results.\n\n### Shifting to User-Based Evaluations\n\nGiven the limitations of static benchmarks, user-based platforms like Chatbot Arena are gaining prominence.  While imperfect (susceptible to biases), these evaluations provide uncontaminated insights into real-world user experience and interactions with LLMs.  However, Chatbot Arena's coverage remains limited.\n\n### The Future of LLM Evaluation\n\nFuture evaluation needs will focus on direct assessments tailored to specific downstream tasks.  This necessitates expertise in LLM evaluation methods, appropriate infrastructure, and domain-specific knowledge. New benchmarks should prioritize human-created data, avoiding reliance on internet-sourced solutions, and incorporate regular updates to counter rapid model advancements.", "url": "https://newsletter.ruder.io/p/the-evolving-landscape-of-llm-evaluation"}, {"title": "Command R+", "short": "Cohere's Command R+ LLM is a game-changer!  It's the top-ranked open-weight model on Chatbot Arena, outperforming some GPT-4 versions.  It's cost-effective, excels in RAG, tool use, & multilingual support, and boasts publicly available weights. #LLM #AI #OpenSource #Cohere #CommandRPlus", "long": "### Command R+ - Top Open-Weight LLM\n\nCommand R+ is a new 104B parameter large language model (LLM) from Cohere, achieving top ranking on Chatbot Arena, surpassing even some GPT-4 versions.  This is significant because it's among the first near-GPT-4 performance models available for research, bridging the gap between open-source and closed-source LLMs. \n\n### Cost-Effective Performance\n\nCommand R+ offers GPT-4 level performance at a significantly lower cost, making advanced LLM capabilities more accessible for research and certain business applications.  This is particularly beneficial given the expense associated with many leading LLMs.\n\n### Enhanced Capabilities\n\nBeyond chatbot functionality, Command R+ excels in areas often underrepresented in benchmarking, including Retrieval Augmented Generation (RAG), tool usage, and multilingual support.  This expanded functionality makes it more versatile for various applications. \n\n### RAG and Tool Use\n\nThe model's RAG capabilities, featuring inline citations, enhance the reliability and trustworthiness of its responses—crucial for enterprise needs.  Its zero-shot multi-step tool use, facilitated through LangChain integration, further improves efficiency and understanding. \n\n### Multilingual Proficiency\n\nPre-trained on 23 languages, Command R+ shows strong performance in many languages beyond English, particularly in non-Latin script languages (Japanese, Korean, Chinese) where it outperforms comparable models.  Its optimized tokenizer also reduces API costs for non-English users.\n\n### Open-Source Accessibility\n\nCommand R+'s publicly available weights encourage community contributions and facilitate further research, accelerating the progress of open-source LLM development.  However, it has a non-commercial license, requiring collaboration for commercial use.", "url": "https://newsletter.ruder.io/p/command-r"}, {"title": "True Zero-shot MT", "short": "LLMs are achieving near human-level translation, even in zero-shot scenarios!  New research uses a unique dataset (MTOB) with limited linguistic resources for Kalamang, an endangered language, to evaluate LLMs' ability to translate unseen languages.  Long-context models show promise, but interdisciplinary collaboration with linguists is key to advancing NLP for under-represented languages.", "long": "### True Zero-Shot Machine Translation\n\nThe article explores the groundbreaking advancements in machine translation (MT), focusing on \"true zero-shot MT.\"  This involves translating into a language completely unseen during a model's training, relying solely on in-context learning from resources like bilingual word lists, a few parallel sentences, and grammar books.\n\n### Low-Resource Language Translation\n\nThe challenge of translating low-resource languages, those with limited training data, is addressed.  Recent benchmarks, such as the Conference on Machine Translation (WMT), are pushing the field to develop MT systems for these languages.\n\n### Resources for Language Learning in LLMs\n\nThe article delves into how large language models (LLMs) can leverage available resources, similar to how humans learn a second language: bilingual lexicons (word lists), small parallel datasets, and reference grammars.  Methods like data augmentation and lexical prompting are highlighted.\n\n### The MTOB Dataset\n\nThe MTOB (Machine Translation from One Book) dataset is introduced as a crucial benchmark. It offers the above-mentioned linguistic resources for Kalamang, an endangered language, enabling evaluation of LLMs in a true zero-shot setting, and comparing LLM performance to a human baseline. \n\n### Future Impact and Research Directions\n\nThe article concludes by discussing the implications of these results.  The need for long-context models and datasets is stressed, along with a focus on multi-modal approaches for primarily spoken languages.  Interdisciplinary collaboration between NLP researchers and linguists is underscored as crucial for progress.", "url": "https://newsletter.ruder.io/p/true-zero-shot-mt"}, {"title": "Thoughts on the 2024 AI Job Market", "short": "The AI job market is booming! Applied research is king, startups are a serious contender to a PhD, but openness is waning.  LLMs have spawned huge collaborative projects, creating many new opportunities.  Learn where to find them!", "long": "### AI Job Market: Applied Research Takes Center Stage\n\nThe AI job market has dramatically shifted in recent years, with a convergence of fundamental and applied research creating new opportunities.  The power of pre-trained models has bridged the gap, making research directly applicable to real-world products and applications.\n\n### Startups Emerge as a Viable Alternative\n\nStartups offer a compelling alternative to a PhD for those seeking cutting-edge AI experience.  They provide faster hands-on learning and exposure to the latest methodologies like instruction tuning and LLM alignment, but require adaptability and comfort with ambiguity.\n\n### Openness and Polarization\n\nWhile the ML community once championed openness, with open-sourced models and research, a recent trend shows some large companies are keeping key model details and architectures private.  This has increased the challenge for independent researchers.\n\n### Large-Scale Collaborations Define Research\n\nThe size and scale of research projects have grown enormously.  LLM development now often requires massive global collaborations, necessitating a diversity of skills and expertise, from data processing and RL to safety and infrastructure, resulting in a shift away from smaller, independent research. \n\n### Abundant Opportunities Across Various Companies\n\nThe rise of generative AI has created a plethora of new companies. This presents significant opportunities for AI professionals but makes selecting the right company a crucial decision. The author shares their considerations when selecting Cohere as their new employer, including a focus on openness, culture, and impact.", "url": "https://newsletter.ruder.io/p/thoughts-on-the-2024-ai-job-market"}, {"title": "The Big Picture of AI Research", "short": "The #BigPictureWorkshop at #EMNLP2023 explored contradictory AI research findings, focusing on In-Context Learning, attention as explanation, and AI morality.  A debate-style format proved successful, highlighting the importance of collaboration in advancing AI research. #AI #ML #NLP", "long": "### The Big Picture of AI Research: A Workshop Retrospective\n\nThis article summarizes the author's experience organizing and attending the Big Picture Workshop at EMNLP 2023, focusing on invited talks that consolidated seemingly contradictory research findings.\n\n### In-Context Learning (ICL)\n\nThe workshop addressed the question of whether ground-truth labels are necessary for successful ICL.  While some research suggested random labels suffice, the workshop speakers argued that label correctness remains crucial, especially in real-world applications, although the influence might vary. ICL seems to leverage pre-training priors rather than on-the-fly learning, even in large language models.\n\n### Attention as Explanation\n\nThe discussion around \"Attention is not Explanation\" papers concluded that while attention mechanisms in LSTMs can provide faithful explanations under specific conditions,  their usefulness for instance-level explanations in modern Transformers is limited.  Attention's role lies more in understanding the general mechanisms of Transformers.\n\n### Machine Learning Morality\n\nResearch into teaching AI morality was reviewed, focusing on datasets like Commonsense Norm Bank and Value Kaleidoscope.  The speakers highlighted the inherent challenges and the importance of honest, collaborative scientific debate to address disagreements and refine our understanding of AI ethics.\n\n### Research Vision\n\nThe author praises Raymond Mooney's invited talk on maintaining research passion.  Mooney's 40-year career serves as an inspiring example of how research visions evolve and adapt to new discoveries, spanning multiple domains within AI.\n\n### Workshop Success\n\nThe article concludes with the author's positive assessment of the workshop's experimental debate-style format, advocating for more nuanced, collaborative approaches to scientific presentations and research dissemination.  All materials are available online for those wishing to organize similar workshops.", "url": "https://newsletter.ruder.io/p/the-big-picture-of-ai-research"}, {"title": "Hypergraphs and RDF", "short": "Unlock the power of hypergraphs in RDF!  Turtle syntax allows for representing sets of objects within triples, enabling rich data modeling. Learn how RDF Lists, named graphs (TRIG), SPARQL, & SHACL create hypergraphs for ordered data processing and beyond. #RDF #Hypergraphs #SPARQL #SHACL #KnowledgeGraphs", "long": "### Hypergraphs: An Introduction\nHypergraphs extend traditional graphs by allowing edges to connect to multiple nodes simultaneously, not just pairs. This enables richer representations of relationships.\n\n### Hypergraphs and RDF\nWhile RDF itself isn't inherently a hypergraph, the Turtle syntax offers a way to represent hypergraph-like structures using RDF lists or bags.  These structures act as sets that connect to single nodes, mimicking hypergraph behavior.\n\n### Practical Applications\nThe article explores the practical use of this Turtle-based hypergraph representation.  It shows how RDF lists allow ordered processing of data, beneficial for scenarios like displaying book chapters in order.\n\n### Object Hypergraphs\nObject hypergraphs arise when multiple properties (edges) connect a single node (subject) to a set of objects.  The author discusses design choices and techniques to effectively manage such structures, such as organizing objects into categories.\n\n### Named Graphs and Hypergraphs\nNamed graphs, supported by TRIG and SPARQL 1.1, significantly enhance the hypergraph capabilities of RDF. They allow a graph itself to be treated as a node within the larger structure, enabling sophisticated modeling.\n\n### Conclusion\nThe article concludes by highlighting the power of named graphs to represent complex hypergraphs and suggests potential applications like self-modifying code using SHACL and SPARQL UPDATE, especially in conjunction with AI.", "url": "https://ontologist.substack.com/p/hypergraphs-and-rdf"}, {"title": "Trump’s Appointing an AI Czar: Game-Changer Or A Pandora’s Box?", "short": "President-elect Trump's potential AI czar appointment is a game-changer!  It could accelerate US AI dominance but risks ethical issues & conflicts of interest.  What will happen next?", "long": "### Trump's AI Czar Proposal: A Bold Move\nPresident-elect Trump is considering appointing an AI czar to lead the nation's AI strategy. This move aims to accelerate AI development and maintain America's global competitiveness, particularly against China.\n\n### Potential Benefits\nA centralized AI strategy could streamline federal policy, boost AI applications in national security and cybersecurity, stimulate economic growth by creating high-tech jobs, and bring regulatory clarity to the AI sector.\n\n### Potential Risks\nConcerns exist about potential conflicts of interest, given Elon Musk's expected involvement.  There are also concerns regarding data privacy issues from accelerated AI development and the lack of checks and balances on governmental power.\n\n### Ethical Implications\nNavigating ethical dilemmas like algorithm bias and AI's impact on human decision-making is critical.  A more distributed approach to AI governance may be necessary to avoid consolidating excessive power.\n\n### Global Competition\nChina's AI advancements pressure the U.S. to maintain its technological edge. This proposal signals a potentially assertive AI policy under the Trump administration.  Industry groups are cautiously optimistic but emphasize the need for ethical oversight.\n\n### Conclusion\nThe AI czar's appointment could dramatically alter America's tech policy.  Its success hinges on balancing technological advancement with ethical considerations and effective oversight.", "url": "https://solrashidi.substack.com/p/trumps-appointing-an-ai-czar-game"}, {"title": "The 1st Ever Deep Fake Allegations Have Been Made In The Presidential Campaign", "short": "Trump's 1st-ever deepfake allegation! He claims Harris used AI to inflate rally crowd sizes. Deepfakes threaten elections by blurring fact & fiction.  Beware of misinformation online; verify everything!", "long": "### Deepfake Allegations in Presidential Campaign\nDonald Trump accused Kamala Harris of using deepfake technology to exaggerate the size of her campaign crowds in Michigan. This marks the first such allegation in presidential campaign history.  Trump's claim, made via Truth Social, suggests that Harris's image manipulation constitutes election interference and calls for her disqualification.\n\n### Deepfakes as a Growing Threat\nThe article highlights the increasing threat of deepfakes, where the manipulation of images and videos blurs the line between reality and falsehood.  This has significant implications for democratic processes and institutions. Convincingly fabricated videos could be weaponized to damage a candidate's reputation, unduly influence public opinion, or even affect election results.\n\n### The Role of Social Media\nThe incident underscores how social media facilitates the spread of misinformation. The article points out that individuals are more likely to believe what they encounter online without sufficient fact-checking, creating an environment where deepfakes could easily manipulate public perception.  Critical thinking and verification of information are crucial in combating the potential harm.\n\n### Importance of Due Diligence\nThe author stresses the importance of critical thinking and due diligence in evaluating online information.  Mindless scrolling and the acceptance of headlines at face value contribute to the problem.  The current social media landscape provides fertile ground for deepfakes to cause significant damage, highlighting the urgent need for media literacy and verification practices.", "url": "https://solrashidi.substack.com/p/the-1st-ever-deep-fake-allegations"}, {"title": "How Many F**king Types of AI Are Out There?!", "short": "The AI world is exploding! From Applied AI to Generative AI and now Physical AI, the lexicon is constantly evolving.  Understanding these different types is crucial for navigating this rapidly advancing field #AI #ArtificialIntelligence #GenerativeAI #PhysicalAI", "long": "### The Ever-Expanding World of AI\n\nThe field of artificial intelligence is rapidly evolving, with new applications and terminology emerging constantly.  This makes it difficult even for experts to keep track of all the different types of AI.\n\n### From Applied to Generative to Physical AI\n\nInitially, we had \"Applied AI,\" focusing on specific tasks. Then came \"Generative AI,\" capable of creating new content. Now, a new term is gaining traction: \"Physical AI.\"  Physical AI involves AI systems that directly interact with and manipulate the physical world, such as robots and autonomous vehicles.\n\n### The Need for Clarity in AI Terminology\n\nThe proliferation of AI terms can be confusing, hindering effective communication and collaboration within the field. Clear definitions and consistent usage are crucial for researchers, developers, and the public to understand the capabilities and limitations of different AI systems. \n\n### Understanding the Nuances of AI\n\nIt is vital to understand the specific strengths and weaknesses of each type of AI to apply them appropriately.  For instance, while Generative AI excels at content creation, it may lack the real-world interaction capabilities of Physical AI.  Different applications demand different approaches and expertise.\n\n### The Future of AI\n\nThe rapid pace of AI development will undoubtedly lead to further specialization and the emergence of even more AI types.  However, efforts should be made to ensure consistent communication and understanding around terminology and application to prevent confusion and maximize the impact of this transformative technology.", "url": "https://solrashidi.substack.com/p/how-many-fking-types-of-ai-are-out"}, {"title": "Are We All Destined To Have Frenemies: Navigating Collaboration & Competition", "short": "Microsoft now considers OpenAI a competitor, highlighting the common \"frenemy\" dynamic. This article explores navigating collaboration & competition, offering advice on setting boundaries, embracing strengths, and viewing frenemies as opportunities for growth & innovation. #frenemies #competition #collaboration #business #growth", "long": "### Frenemies: A Modern Reality\n\nThe article explores the increasingly common phenomenon of \"frenemies\"—individuals or organizations who are simultaneously collaborators and competitors.  It uses the recent announcement of Microsoft viewing OpenAI as a competitor, despite their close past relationship, as a prime example.\n\n### Common Frenemy Scenarios\n\nThe author details several relatable scenarios where frenemies emerge: former friends competing for a promotion, business partners developing rival products, and even close family members experiencing unhealthy codependency.\n\n### Navigating Frenemy Relationships\n\nThe piece then provides a five-step approach to navigating these complex relationships:\n\n1. **Accept the inevitability:**  As businesses or individuals grow, overlapping interests and competition are normal, not inherently negative.\n2. **Set clear boundaries:**  Whether with friends, partners, or family, defined boundaries are crucial to maintain healthy dynamics.\n3. **Embrace your uniqueness:**  Focus on what differentiates you, avoiding direct competition in your frenemy's area of strength.\n4. **Maintain an abundance mindset:**  Believe there is enough success for everyone; focus on the bigger picture.\n5. **Learn and grow:**  Frenemy situations are learning opportunities, providing insights into competitor strengths and stimulating innovation. \n\n### Historical Examples\n\nThe article highlights examples of successful frenemy relationships such as Steve Jobs and Bill Gates, and Larry Ellison and Marc Benioff, illustrating that collaboration and competition can fuel industry growth.\n\n### Conclusion\n\nThe article concludes by encouraging readers to view frenemies not as obstacles but as checkpoints.  These relationships become opportunities for self-improvement, adaptability, and resilience.", "url": "https://solrashidi.substack.com/p/are-we-all-destined-to-have-frenemies"}, {"title": "Why Intellectual Atrophy Is The Real Reason To Fear AI", "short": "Forget job losses!  The REAL AI threat? Intellectual atrophy.  Over-reliance on AI weakens critical thinking.  Upskill & develop human ingenuity to thrive in this new era. #AI #ArtificialIntelligence #FutureOfWork #CognitiveSkills", "long": "### Intellectual Atrophy: The Real AI Threat\nWhile job displacement is a common fear surrounding AI, this article argues that the greater danger lies in intellectual atrophy.  Our increasing reliance on AI tools and digital devices may diminish our critical thinking, common sense, and intuition.\n\n### Over-Reliance on Technology\nThe accessibility of AI solutions promotes over-reliance, hindering our ability for independent thought and problem-solving.  We may become cognitively stagnant, losing the ability to fully engage our mental capacities.\n\n### The Job Market Shift\nThe World Economic Forum predicts a net gain of jobs, but the transition will likely favor soft skills and emotional intelligence.  Many roles may be automated, leaving those lacking advanced critical thinking skills vulnerable.\n\n### The Importance of Human Ingenuity\nDeveloping and honing human cognitive skills is now more vital than ever to differentiate ourselves from machines. We must actively engage in challenging activities to strengthen our brains and ensure we remain relevant in the evolving workforce.\n\n### Key Statistics\nGartner forecasts that 75% of enterprises will operationalize AI by 2024, while Deloitte highlights a 68% skill gap in AI talent.  These statistics emphasize the urgency for upskilling and adapting in the face of technological advancement.\n\nThe article concludes with a call to actively cultivate human cognitive abilities to thrive in a world increasingly shaped by AI.", "url": "https://solrashidi.substack.com/p/why-intellectual-atrophy-is-the-real"}, {"title": "4 Reasons Why AI Hype is Outpacing AI Investments", "short": "Massive AI investment isn't translating into adoption!  Fear, difficulty in assessing ROI, implementation complexity, and competing priorities are key hurdles.  Will adoption catch up to investment?  Find out in this article!", "long": "### Billions Invested, Little Adoption\n\nDespite massive investments in AI, only a small percentage of US companies utilize it.  This article explores the reasons behind this discrepancy.  While billions are poured into AI capabilities, actual adoption rates are far lower than expected, leaving a huge gap between investment and implementation.\n\n### Fear of AI\n\nMany companies are hesitant to embrace AI due to fears of job displacement, data security breaches, and unpredictable results. The uncertainty and potential risks associated with AI adoption are major obstacles. \n\n### Difficulty Assessing Business Value\n\nQuantifying AI's return on investment (ROI) proves challenging for many businesses.  The abstract nature of AI's impact makes it difficult to measure its direct contribution to the bottom line, leading to hesitancy in investment. \n\n### Complexity of AI Implementation\n\nIntegrating AI into existing business processes is complex and often requires significant technical expertise and organizational changes. This complexity deters many businesses from even attempting implementation.\n\n### Competing Priorities\n\nBusinesses often juggle multiple strategic priorities. AI, while promising, may not always rank high enough to secure the necessary resources and attention for successful implementation, especially with existing concerns and priorities.\n\nThe article concludes that although AI's transformative potential is undeniable, widespread adoption will lag investment unless these challenges are addressed.", "url": "https://solrashidi.substack.com/p/4-reasons-why-ai-hype-is-outpacing"}, {"title": "The Invisible Hand Shaping Your Future", "short": "Apple & Microsoft tried to get on OpenAI's board, but EU's Margrethe Vestager stepped in.  They withdrew after the investigation began, highlighting how regulations keep Big Tech in check. Stay informed, everyone can make a difference!", "long": "### Apple and Microsoft's Attempted OpenAI Board Seats\n\nApple and Microsoft recently attempted to gain non-voting seats on OpenAI's board.  This move raised concerns about potential conflicts of interest and the ability of large tech companies to unduly influence smaller competitors.\n\n### EU's Intervention\n\nEU Competition Commissioner Margrethe Vestager initiated an investigation into the matter, citing concerns about Big Tech's ability to stifle innovation and competition.\n\n### The Outcome\n\nFollowing Vestager's investigation, both Apple and Microsoft withdrew from their non-voting board seats, highlighting the effectiveness of regulation and oversight in preventing potential abuses of power by tech giants. \n\n### Importance of Regulation and Awareness\n\nThis situation underscores the importance of regulations, governance, and ethical considerations within the tech industry.  It also stresses the need for informed public awareness to ensure that the technology industry evolves responsibly and fairly.  Citizens and tech professionals alike should actively monitor the industry's decisions to prevent potentially negative outcomes.\n\n### Individual Impact\n\nEven without being a technology expert, individuals can make an impact by staying informed and holding powerful entities accountable.  Public awareness and advocacy play a crucial role in shaping a technology landscape that prioritizes ethical development and fair competition.", "url": "https://solrashidi.substack.com/p/the-invisible-hand-shaping-your-future"}, {"title": "How to Build a Strategy", "short": "77% of strategies fail! Learn how to build a sound strategy by assessing your organization's readiness across 6 key areas (Market, Business, Workforce, Culture, Data & Tech) and align it with your maturity level. Avoid unrealistic goals and choose the right focus (Growth, Productivity, Efficiency, Effectiveness, or Knowledge). Get Sol Rashidi's book for more.", "long": "### How to Build a Strategy\n\nSol Rashidi's article focuses on the crucial yet often overlooked skill of strategy building.  Many people lack formal training and rely on unreliable sources like Google, leading to ineffective strategies.  The author highlights a key finding from a recent workshop: 77% of participants felt their strategies were ineffective.\n\n### Six Key Areas for Assessment\n\nBefore building a strategy, the article recommends an organizational readiness assessment. This assessment spans six key areas: Market Understanding, Business Understanding, Workforce Acumen, Company Culture, Data, and the Role of Technology. Your ranking in these areas determines your organizational maturity, guiding you to build a 'stretch' goal—ambitious, yet realistic.\n\n### Types of Strategies\n\nThe article outlines five types of strategies to focus on: Growth-Based, Productivity-Based, Efficiency-Based, Effectiveness-Based, and Knowledge-Based.  Choosing the right type depends on your organization's needs and the results of the readiness assessment.  The strategy should align with your organization's current capabilities to avoid failure.\n\n### Course Correction\n\nThe author emphasizes that a successful strategy requires careful planning and a readiness assessment. It involves identifying strengths and weaknesses, setting realistic goals that push the organization's boundaries without exceeding them, and ensuring it aligns with organizational maturity.  Course correction is part of the process, and not a sign of failure.\n\n### AI Strategy\n\nWhile applicable to various domains, the author uses an AI strategy as an example. The principles for constructing an AI strategy are the same as for other types of strategies: a combination of self-assessment, target setting, and adaptation based on the organization's capabilities and maturity.", "url": "https://solrashidi.substack.com/p/how-to-build-a-strategy"}, {"title": "BEST SELLER: 'Your AI Survival Guide!'", "short": "Sol Rashidi's \"Your AI Survival Guide\" is a best-selling guide demystifying AI for everyone, from techies to curious newcomers.  Learn where to embrace AI's power and where to tread carefully with the help of an expert with 25+ years of experience.  Get your copy on Amazon now! #AI #ArtificialIntelligence #Technology #YourAISurvivalGuide", "long": "### AI is Everywhere\n\nWhether you're a tech expert, business leader, or simply curious about AI, Sol Rashidi's best-selling book, 'Your AI Survival Guide,' offers a simplified explanation of AI's impact.  It caters to both technical and non-technical audiences, clarifying facts and fiction surrounding AI.\n\n### Demystifying AI\n\nThe book helps readers understand AI's capabilities, its potential benefits, and its risks. Learn how to navigate this rapidly evolving technology, identifying areas where caution is needed and where AI can be effectively applied.  It benefits from over 25 years of experience in the field.\n\n### Sol Rashidi's Expertise\n\nSol Rashidi's impressive background includes 8 patents, recognition as a Forbes 'AI Visionary & Maverick', and accolades like 'Top 100 AI Thought Leaders'. This real-world experience allows her to explain complex AI concepts accessibly and humorously.\n\n### Best-Seller Status\n\n'Your AI Survival Guide' has achieved best-seller status on platforms like Amazon, Barnes & Noble, and C-Suite Network. It provides practical, actionable insights rather than just hype. This makes it the perfect resource for anyone wanting to understand and harness the power of AI, and avoid its pitfalls. \n\n### Get Your Copy Now\n\nThe book is available for purchase on Amazon and Barnes & Noble.  Learn to navigate the world of AI with confidence and practical know-how.", "url": "https://solrashidi.substack.com/p/best-seller-your-ai-survival-guide"}, {"title": "WHY I got my A*SSS handed to me when I went from Practitioner to C-Suite!", "short": "From practitioner to C-suite?  It's not just about IQ!  Learn from my mistakes & avoid the pitfalls.  Joe Reis & I are offering a course to help you transition smoothly & build leadership skills.  25% off for Substack followers! #leadership #careers #Csuite #practitioner", "long": "### Challenges of Transitioning from Practitioner to C-Suite\n\nThe author, a C-suite executive, shares their experiences and challenges in transitioning from a practitioner role to a leadership position.  They highlight unexpected difficulties such as receiving critical feedback on their leadership style, the added responsibility of managing team morale, and a shift from individual contribution to people management.\n\n### The Shift in Focus\n\nThe author found that the transition required a different skillset.  It's no longer just about technical expertise (IQ), but also emotional intelligence (EQ), self-awareness (SQ), and business acumen (BQ). The ability to articulate business value using data also became more crucial.\n\n### Learning from Mistakes\n\nThe author emphasizes the importance of understanding the distinction between strong individual contributions and effective leadership. They admit to several setbacks due to this lack of understanding early in their leadership journey.\n\n### A Collaborative Course\n\nTo help others avoid similar pitfalls, the author partnered with Joe Reis to create a course on Maven. This course aims to bridge the gap between technical skills and leadership requirements for practitioners aspiring to C-suite roles.\n\n### A Special Offer\n\nThe author offers a 25% discount on the course to Substack followers.  The course promises to enhance leadership, influence, organizational scaling, and both professional and personal development skills. It focuses on building crucial skills to transition effectively into leadership roles in business contexts.", "url": "https://solrashidi.substack.com/p/why-i-got-my-asss-handed-to-me-when"}, {"title": "How do you build a Center of Excellence for Data, Analytics, and AI!", "short": "Building a successful Data, Analytics & AI CoE?  Focus on clear objectives, solving pain points, aligning your team (Skill/Will Matrix!), managing interdependencies, and implementing a feedback loop.  A hub-and-spoke organizational model often works best!", "long": "### Building a Successful Center of Excellence (CoE) for Data, Analytics, and AI\n\nSol Rashidi, a veteran Chief Data and AI Officer, shares insights on building effective CoEs.  He emphasizes that a one-size-fits-all approach doesn't work; instead, focus on these key principles:\n\n### Defining Objectives and Purpose\n\nClearly define the CoE's mission: capability building, service provision, governance, or a combination.  A service-oriented CoE is more likely to be influential, directly solving business problems.\n\n### Identifying the Pain Point\n\nUnderstand the specific business challenges your CoE addresses.  Articulate the value proposition repeatedly to gain buy-in and encourage team members and stakeholders to become advocates.\n\n### Team Alignment and Skill Assessment\n\nUtilize the Skill/Will matrix to evaluate team members. High-skill/high-will members are invaluable, while those lacking both skill and will should be replaced. Coach those who have will but lack skill. This will ensure the overall effectiveness of the CoE.\n\n### Managing Interdependencies\n\nAcknowledge dependencies on other teams and assign dedicated team members as liaisons.  Develop strong relationships with leaders in dependent functions to ensure collaboration and avoid conflicting decisions.\n\n### Establishing a Feedback Loop\n\nImplement a continuous feedback loop to gather insights from various stakeholders.  Use this input to refine processes and enhance service delivery.\n\n### Choosing an Organizational Model\n\nSelect an organizational model tailored to your company’s structure (fragmented, federated, centralized, or hub-and-spoke). A hub-and-spoke model is often the most effective for medium to large enterprises, allowing for centralized control while having localized pods.", "url": "https://solrashidi.substack.com/p/how-do-you-build-a-center-of-excellence"}, {"title": "The Blueprint for Success: Writing a Comprehensive 'Strategy' deck for your Product, Org, AI, or Data.", "short": "Crafting a compelling strategy deck? This article provides a 14-point blueprint covering all essentials: from executive summary & team intro to roadmap, ROI, risks & mitigation.  Make your strategy clear, concise & comprehensive! #strategy #business #AI #data", "long": "### What makes writing a strategy deck difficult?\n\nCreating a truly effective strategy deck requires more than just outlining ideas; it demands comprehensive coverage of key elements, clear and concise writing to ensure understanding, a balanced format that blends text, visuals, and data, and a well-structured narrative that flows logically.\n\n### Key components for a comprehensive strategy deck:\n\nThe article provides a 14-point checklist covering all the essential components for a solid strategy deck.  These include an executive summary, team introduction, alignment with business objectives, market and competitive analysis, identification of gaps and opportunities, outlining capabilities and developments, assessing technology and data infrastructure needs, talent requirements, addressing ethical and governance aspects, creating a detailed roadmap, outlining anticipated investments and ROI, presenting risk mitigation strategies, showcasing case studies and benchmarks, and finally, a clear call to action.\n\n### Applying the checklist:\n\nThis checklist is versatile enough to be used for product, company, AI, or data strategies. Each point is designed for sequential understanding, emphasizing the importance of a clear narrative and avoiding any guesswork.\n\n### Further assistance:\n\nThe author offers a call to action, inviting readers to schedule a consultation for feedback or further help on their strategy.", "url": "https://solrashidi.substack.com/p/the-blueprint-for-success-writing"}, {"title": "NEVER Select a Use Case Based on BUSINESS VALUE (BV)! There are 9 Other Key Considerations.", "short": "Stop prioritizing use cases ONLY on business value!  Consider complexity (stakeholder involvement, resources, data) & criticality (competition, regulations, public exposure, strategic fit) for better project success.  A holistic approach is key!", "long": "### Selecting Use Cases: Beyond Business Value\n\nMany factors influence use case selection beyond simple business value.  Stakeholders have competing priorities, and focusing solely on business value can lead to project failure.\n\n### Complexity Assessment\n\nBefore selecting a use case, assess its complexity:\n\n* **Stakeholder Involvement:** How engaged and supportive will key stakeholders be?\n* **Resource Availability:** Are necessary resources readily available?\n* **Data Accessibility:** Is the required data accessible and high-quality?\n* **Inter-team Dependencies:** How easy will it be to collaborate with other teams?\n* **Infrastructure:** Is the needed infrastructure already in place?\n\nRate each use case on these factors to identify potential roadblocks.\n\n### Criticality Evaluation\n\nThen, consider the use case's criticality:\n\n* **Competitive Threat:** Does it strengthen market position against competitors?\n* **Market Consolidation:** Does it support channel strategies in consolidating markets?\n* **Regulatory Compliance:** Does it mitigate risks of fines for non-compliance?\n* **Public Exposure:** Could it spark public debate or controversy?\n* **Strategic Alignment:** Does it align with the company's broader strategic goals?\n\nRate each use case again, considering these critical aspects.\n\nPrioritize use cases based on both complexity and criticality alongside business value for success. A holistic approach increases the chance of timely, budget-friendly, and impactful delivery.\n\n### Prioritization Matrix\n\nCreate a matrix to compare all use cases by weighting Complexity and Criticality factors.  Higher weights on simpler projects with high-criticality are better candidates.  Business Value remains important but shouldn't be the sole decider.", "url": "https://solrashidi.substack.com/p/never-select-a-use-case-based-on"}, {"title": "THANK YOU!", "short": "Sol Rashidi's newsletter hit 1,000 subscribers in under 30 days! 🎉 Huge thanks to the amazing community that made this happen. First newsletter coming soon! Subscribe now to join the journey! 🚀 #newsletter #milestone #community #AI #tech", "long": "### Sol Rashidi's Newsletter Reaches 1000 Subscribers\n\nSol Rashidi's newsletter has achieved a significant milestone, reaching 1,000 subscribers in under 30 days.  This success is attributed to the engaged community that has grown around the publication.\n\n### Expressing Gratitude to the Community\n\nRashidi expresses sincere gratitude to their original 1,000 subscribers, emphasizing the importance of this community in their new venture. The supportive readership is highlighted as crucial to their success.\n\n### Upcoming Newsletter Content\n\nA promise of a first official newsletter is made, hinting at upcoming content and further engagement with the audience. The anticipation for the newsletter's launch is palpable.\n\n### New Venture and Future Plans\n\nThe 1,000 subscribers represent a key step for Rashidi's new undertaking. This success is a testament to the reception of their content and indicates a positive outlook for future growth and development.  The achievement reflects well on the writer's dedication and skill.\n\n### Call to Action: Subscribe\n\nThe article includes a call to action, encouraging readers to subscribe to receive future posts and stay engaged with the growing community. This encourages further growth of the newsletter's audience and is essential for ongoing success. ", "url": "https://solrashidi.substack.com/p/thank-you"}, {"title": "Building AI Agents from scratch - Part 2: Reflection and Working Memory", "short": "Learn to build AI agents from scratch! Part 2 covers the Reflection pattern & short-term memory for improved accuracy.  Fix hallucinated plans & enhance your agent's problem-solving abilities.  Check out the code on Github!", "long": "### Building AI Agents From Scratch - Part 2\nThis article continues the series on building AI agents without using frameworks.  Part 2 focuses on implementing the reflection pattern and adding simple short-term memory.\n\n### Reflection Pattern Explained\nReflection allows an AI agent to review its output, identify flaws, and suggest improvements.  This can significantly enhance accuracy, especially when dealing with complex queries that require multiple steps.\n\n### Reflection in Different Agentic Flows\nSeveral approaches for integrating reflection are detailed, ranging from a single feedback loop to iterative refinement within complex multi-step processes.  The article explores the pros and cons of each.\n\n### Reflection and Working Memory\nEffective reflection requires short-term memory.  A simple implementation of working memory is presented, involving storing each interaction (user query and plan) in a list for future reference.\n\n### Hands-on Example: Currency Conversion\nA detailed example using a currency conversion tool demonstrates how reflection is applied to fix a plan when there are issues. It shows how the agent identifies and corrects its previous mistakes and revises its plan.\n\n### Code Examples\nThe code used throughout the article is available on Github, including a Jupyter notebook for hands-on learning and experimenting.\n\n### Conclusion\nThe article summarizes the advantages and disadvantages of using reflection, highlighting that it provides improved accuracy at the cost of increased complexity and cost.  Overall, it provides a clear explanation of reflection coupled with memory for building efficient and more accurate AI agents. ", "url": "https://www.newsletter.swirlai.com/p/building-ai-agents-from-scratch-part-8ca"}, {"title": "Building AI Agents from scratch - Part 1: Tool use", "short": "Build AI agents from scratch! Learn tool use, system prompt engineering, and Agent class implementation without frameworks.  Get the code and build your own agent today! #AI #Agents #LLM #Python", "long": "### Building AI Agents from Scratch\nThis article is the first in a series that will guide you through building AI agents from scratch without using any frameworks.  It focuses on implementing tool use capabilities.\n\n### Understanding AI Agents\nAn AI agent uses an LLM as its reasoning engine to decide the steps needed to fulfill a user's intent. Key components include planning (sequencing actions), memory (short and long-term), and tools (functions for enhanced reasoning, such as simple code functions, databases, or other agents).\n\n### Tool Use: High-Level Overview\nLLMs don't run code directly.  The article emphasizes the critical role of prompt engineering, particularly crafting system prompts with tool definitions and expected outputs.  Effectively structuring system prompts is key to successful tool usage.\n\n### Implementing the Agent\nThe article demonstrates how to use a Python decorator to wrap functions, extracting information such as function name, description, and parameters. This information is passed to the LLM via a JSON formatted system prompt for efficient processing.\n\n### The System Prompt\nThe system prompt meticulously defines the agent's role, capabilities, and instructions. A JSON format is used for better LLM performance.  It specifies required tools, output format (JSON schema), and examples of how to respond for better understanding.\n\n### Agent Class Implementation\nThe Agent class is demonstrated.  Methods handle adding tools, listing them, and executing them based on a plan produced by the LLM.  The plan includes the tool to use and its parameters.\n\n### Running the Agent\nFinally, the article shows how to initialize the agent, attach tools, and execute user queries demonstrating how the Agent plans and executes actions.", "url": "https://www.newsletter.swirlai.com/p/building-ai-agents-from-scratch-part"}, {"title": "AI Clouds and their role in the AI era", "short": "Learn how AI Clouds are revolutionizing the AI era! Build your own Mistral-7B chatbot with a step-by-step guide on Nebius AI Cloud.  Compare the costs of proprietary LLM APIs vs. AI Clouds & optimize your application's performance. #AIClouds #LLMs #Nebius #Mistral7B #Chatbot #Kubernetes", "long": "### AI Clouds: The New Cloud for the AI Era\nAI Clouds are cloud platforms specifically optimized for AI workloads, offering GPU-accelerated resources to meet the soaring demand for GPU processing power.\n\n### Hands-on Project: Mistral-7B Chatbot on Nebius\nThis article presents a step-by-step guide to building a Mistral-7B powered chatbot. The project involves setting up a Kubernetes cluster on Nebius AI Cloud, deploying the open-source Mistral-7B-Instruct LLM using vLLM, and creating a Streamlit interface for user interaction.\n\n### Choosing Between Proprietary APIs and AI Clouds\nThe article discusses the Total Cost of Ownership (TCO) for both proprietary LLM APIs (like OpenAI) and AI Clouds for LLM inference. It analyses cost curves, highlighting the scenarios where each option is preferable.  The choice depends on your specific application needs, traffic volume, and latency requirements.  Generally, AI Clouds become more cost-effective at scale.\n\n### Auto-Scaling and Efficiency\nAI Clouds enable granular control over throughput and latency. By strategically using auto-scaling, both cost per inference and response times are optimized. This approach is particularly beneficial for applications with fluctuating traffic demands.\n\n### Project Summary\nThe hands-on project serves as a practical demonstration of deploying and using an open-source LLM on an AI Cloud.  Remember that this example needs further refinement for production-level use.", "url": "https://www.newsletter.swirlai.com/p/ai-clouds-and-their-role-in-the-ai"}, {"title": "What is AI Engineering?", "short": "AI Engineering is evolving rapidly with LLMs. It combines ML, software engineering & research, focusing on robust, non-deterministic AI systems.  Essential skills include research, prompt engineering, software development, infrastructure, data engineering, & AgentOps.  It's the hottest role for the future of AI.", "long": "### What is AI Engineering?\nThe article explores the evolving role of AI Engineering, particularly in the context of Large Language Models (LLMs).  It clarifies that AI systems haven't fundamentally changed but have been enhanced by LLMs' capabilities in planning, content manipulation, and code generation.\n\n### AI Engineering vs. Other Roles\nAI Engineering is distinguished from Machine Learning (ML) and Software Engineering. While ML engineers focus on model building and MLOps, and software engineers on deterministic systems, AI engineers bridge the gap, specializing in building and deploying robust, non-deterministic AI systems using LLMs.\n\n### Essential Skills for AI Engineers\nSuccess in AI engineering demands a blend of skills:  research (understanding white papers and conducting independent investigations), prompt engineering (crafting effective prompts and managing agent interactions), software development and DevOps practices, infrastructure knowledge (including data stores like vector databases), data engineering (data processing and integration), and adapted MLOps for AI systems (AgentOps).\n\n### The Future of AI Engineering\nThe future looks bright for AI engineers.  With the increasing prevalence of agentic systems and autonomous agents across industries, the demand for skilled AI engineers will soar. Full-stack AI engineers, proficient across various disciplines, are poised to become key players in innovation and disruption.", "url": "https://www.newsletter.swirlai.com/p/what-is-ai-engineering"}, {"title": "Memory in Agent Systems", "short": "Agents need memory to solve real-world problems!  This article dives into short-term vs. long-term memory in GenAI agents, explaining episodic, semantic, & procedural memory. Learn how to build better, more context-aware agents!", "long": "### Memory in Agent Systems\nThis article explores the implementation of memory in Generative AI systems, focusing on the importance of memory for agents to solve complex problems.  Agents, unlike basic LLMs, require memory to coordinate actions and reason effectively.\n\n### Types of Agentic Memory\nAgentic memory is categorized into short-term (working) memory and long-term memory. Short-term memory, crucial for immediate decision-making, is limited by LLM context windows and processing costs. Long-term memory is discussed in greater detail, including the three main types: Episodic, Semantic, and Procedural.\n\n### Episodic Memory\nEpisodic memory stores past interactions and actions of the agent. Its implementation is similar to RAG systems, using external storage like vector databases for efficient retrieval of relevant information.  This is vital for agents to recall past interactions and maintain context across multiple sessions.\n\n### Semantic Memory\nSemantic memory contains external knowledge or facts available to the agent, including any knowledge about itself.  It's also compared to RAG systems that source information from external sources.  This type of memory aids agents in accessing information beyond the limits of the LLM.\n\n### Procedural Memory\nProcedural memory comprises instructions, tools, guardrails, and system prompt structures. This represents the codified knowledge and constraints programmed by the developers into the agent. It is crucial for agent control and autonomy limitations.\n\n### Conclusion\nEfficient memory management is critical for agentic applications, and each type of memory presents unique challenges and solutions.  The article emphasizes the importance of understanding various memory types when designing agent architectures.", "url": "https://www.newsletter.swirlai.com/p/memory-in-agent-systems"}, {"title": "Observability in LLMOps pipeline - Different Levels of Scale", "short": "SwirlAI Newsletter returns!  Observability in GenAI systems scales dramatically from fine-tuning to multi-agent networks. Tracing and evaluation become crucial for debugging, cost management, and handling non-determinism.  Learn about the challenges and evolution of LLMOps observability!", "long": "### Re-introduction of SwirlAI Newsletter\nAfter a year-long break, the SwirlAI Newsletter is back, focusing on GenAI Systems Engineering, MLOps, Data Engineering, System Design, and AI news.  The author aims to help readers upskill and stay current in the data world.\n\n### Observability in LLMOps\nThe article discusses the increasing complexity of GenAI applications and their observability challenges.  It highlights how observability infrastructure scales with the complexity of GenAI systems, from simple fine-tuned models to sophisticated multi-agent networks.\n\n### GenAI Value Chain\nThe GenAI value chain is divided into foundation model training (pre-training and post-training) and GenAI systems engineering (fine-tuned models, RAG, agents, and multi-agent networks).  The author notes that production readiness varies across these complexity levels.\n\n### RAG System Observability\nObservability in advanced GenAI is about tracing and evaluation.  Tracing involves tracking spans (atomic actions) within a trace (end-to-end flow), capturing metadata like inputs, outputs, and token counts for cost estimation. Challenges include handling variable data lengths and the need for non-deterministic span-level evaluation.\n\n### Agentic Applications Observability\nAgents utilize LLMs to define actions for task completion.  This introduces non-determinism in the number and type of spans in a trace, requiring dynamic tracing and evaluation techniques.  The complexity increases with the inclusion of knowledge, long-term memory, and tools.\n\n### Multi-Agent Systems Observability\nMulti-agent systems involve interconnected agents, adding another layer of complexity to observability.  Connecting traces from multiple agents, handling event-based communication, and preventing endless loops are key challenges.", "url": "https://www.newsletter.swirlai.com/p/observability-in-llmops-pipeline"}, {"title": "Master LLM Application Development: Course & Free Resources", "short": "Master LLM app development! Hugo Bowne-Anderson & Stefan Krawczyk's course teaches you to go from POC to production-ready AI.  Guest speakers from Google, Airbnb, & more!  Free resources available too. #LLM #AI #MachineLearning #DataScience", "long": "### Master LLM Application Development Course\n\nThis course, developed by Hugo Bowne-Anderson and Stefan Krawczyk, guides software engineers and data scientists to build production-ready AI systems, moving beyond mere proof-of-concept demos.  It emphasizes a robust development cycle for sustainable AI applications.\n\n### Course Highlights\n\nThe course covers crucial aspects like moving from POC to production, mastering prompt engineering and structured outputs, building efficient monitoring and debugging workflows, and iterative model improvement.  Hands-on projects, personalized feedback, and a supportive community are integral.\n\n### Guest Lectures\n\nRenowned AI experts, including Sander Schulhoff (LearnPrompting.org), Charles Frye (Modal), Ravin Kumar (Google Labs), Swyx (Shawn Wang), and Hamel Husain (Parlanse Labs), will provide insights on prompt engineering, hardware optimization, LLM product development, AI agents, and effective data literacy for debugging.\n\n### Free Resources\n\nFor those unable to enroll immediately, complimentary resources include a curated list of essential resources for LLM app development, a cheat sheet outlining the SDLC, guidance on using vector databases, and free lightning lessons covering GenAI app development and LLM application testing.\n\n###  Community and Benefits\n\nThe course fosters a collaborative learning environment with participants from leading tech companies.  Early enrollment offers a 25% discount (code: VG25) and a free 30-minute consultation with Hugo Bowne-Anderson.  Bonus offers for full participants include $1000 in Modal credits and 3 months of Learn Prompting Plus.\n\n###  Enrolling\n\nThe course starts soon, with limited seats available.  Those interested in refining their LLM skills and building reliable AI systems are encouraged to enroll promptly.", "url": "https://hugobowne.substack.com/p/master-llm-application-development"}, {"title": "Building LLM Apps: Essential Resources for Data Scientists and Software Engineers", "short": "Essential resources & conversations on building LLM apps, scaling data functions, testing LLMs, GPU bottlenecks, and scaling AI agents.  Interview with NYT's Chief Data Scientist Chris Wiggins included! #LLM #AI #DataScience #MLOps", "long": "### Essential Resources for Building LLM Apps\n\nCurated by Stefan Krawczyk and Hugo Bowne-Anderson, this list provides open-access resources covering Python, deep learning, MLOps, evaluation, and prompt engineering for building production-ready LLM apps.\n\n### Conversation with Chris Wiggins, NYT Chief Data Scientist\n\nHugo Bowne-Anderson interviews Chris Wiggins on building and scaling data functions, moving beyond prediction to prescriptive interventions using causal inference and reinforcement learning, and the challenges of integrating advanced models with organizational maturity.\n\n### Testing LLMs for Production-Ready Systems\n\nThis section highlights the importance of testing LLMs to ensure reliable, consistent outputs, even with inherent variability. It covers how to structure testing processes to manage this variability and maintain stability in production systems.\n\n### GPU Bottlenecks in LLM Development\n\nHugo Bowne-Anderson discusses GPU limitations with Charles Frye (Modal), emphasizing GPU memory as the main bottleneck. They delve into real-world issues, strategies for efficient fine-tuning, and how to avoid overspending on hardware.\n\n### Scaling AI Agents\n\nInsights from over 300 real-world deployments are presented to highlight the challenges and successes of scaling AI agents in production, focusing on structured workflows, architectural patterns, and avoiding common pitfalls.\n\n### On My Radar\n\nThis section includes a summary of other projects, including participation in the MLOps World Generative AI Summit, an interview on Learning Bayesian Statistics, a fireside chat with Ferras Hamad, and a recap of the High Signal podcast.", "url": "https://hugobowne.substack.com/p/building-llm-apps-essential-resources"}, {"title": "Is Data Science Dead in the Age of AI?", "short": "Data science isn't dead, but it's evolving! AI needs context, not just prompts.  Free Maven lesson on testing LLMs & scholarship for GenAI course.  Plus, a live podcast on GPU fundamentals for AI. #datascience #AI #LLM #GenAI #GPU", "long": "### Is Data Science Dead? Not Quite.\n\nThe article explores the evolution of data science in the age of AI, emphasizing that while automation is changing workflows and reducing some entry-level roles, the field is far from dead.  It's evolving.  \n\n### AI Needs Context, Not Just Prompts\n\nThe author discusses Hilary Mason's perspective:  AI prompt engineering is akin to spellcasting, not proper engineering. Building robust systems needs rich context—structured data and multimodal inputs are crucial. \n\n### Interfaces, Not Just Algorithms\n\nEven with a pause in ML algorithm innovation, years of work remain for efficient workflows, user-friendly tools, and effective interfaces to fully realize AI's potential. This means the data scientist's role is shifting toward system design and integration. \n\n### Testing LLM Applications: Avoiding Demo Hell\n\nTesting is paramount due to LLM's unpredictable outputs.  A free Maven lesson by the author and Stefan Krawczyk teaches how to test these applications reliably, mitigating the risk of failing in a production environment. \n\n### Generative AI Scholarship Opportunity\n\nA scholarship for a four-week GenAI course is announced.  The course builds production-ready AI systems, teaches prompt engineering, and handles structured outputs reliably, equipping participants with practical skills. \n\n### GPU Fundamentals for AI Developers\n\nA live podcast recording with Charles Frye explores the essential role of GPUs in AI development.  The session covers GPU internals, practical advice for developers, and scaling AI workloads effectively.", "url": "https://hugobowne.substack.com/p/is-data-science-dead-in-the-age-of"}, {"title": "Building Reliable GenAI Systems: Lessons, Conversations, and Tools", "short": "Building reliable GenAI systems is challenging!  Learn key lessons from industry experts on tackling unpredictability & hallucinations.  Plus, discover how to build data-driven cultures & impactful AI.  Check out the full article for details and links to workshops & podcasts!", "long": "### Building Reliable GenAI Systems\nThis article dives into the challenges of creating dependable generative AI systems.  It highlights the shift from traditional software development (build, test, deploy) to a continuous iterative process crucial for GenAI.  Key challenges like unpredictable outputs and accuracy issues (hallucinations) are discussed.\n\n### Lessons from Stefan Krawczyk\nStefan Krawczyk (CEO of Dagworks, ex-StitchFix) shares insights from a recent workshop on building robust GenAI systems. He emphasizes the importance of adapting traditional software practices for GenAI, including robust logging and iterative development.  A link to the full session and short video clips are provided.\n\n### Data-Driven Cultures\nA conversation with Gabriel Weintraub (Stanford GSB) explores building data-driven cultures.  The importance of foundational strategies, experimentation, and local innovation are highlighted.  The article includes a link to a podcast episode.\n\n### Start with Evaluations\nRavin Kumar (Google Labs) discusses the significance of starting with evaluations when building AI systems. This approach ensures real-world impact, rather than focusing solely on model selection.  The article includes a link to a podcast episode featuring this discussion.\n\n### High Signal Podcast\nThe article promotes the *High Signal* podcast, showcasing insights from industry leaders on reasoning under uncertainty, simulations, organizational strategies, and strong data foundations.  Links to specific podcast episodes are given.\n\n### Other Highlights\nOther sections briefly mention upcoming events like a Data Dialog with Geetu Ambwani, a PyData NYC tutorial on YouTube, and an Outerbounds Fireside Chat.  Links are provided for these resources.", "url": "https://hugobowne.substack.com/p/building-reliable-genai-systems-lessons"}, {"title": "Escaping AI Proof-of-Concept Purgatory", "short": "Escape AI POC purgatory!  Free lightning class + live podcast with Google Labs, data leadership insights, & new podcast featuring top AI minds. #AI #LLM #MachineLearning #DataScience", "long": "### Escaping AI Proof-of-Concept Purgatory\n\nThis newsletter explores how to move beyond AI proof-of-concepts and create robust, reliable systems.  A free lightning class on building LLM applications is offered this week with Stefan Krawczyk.\n\n### This Week's Events\n\nSeveral events are highlighted:\nA live podcast recording with Ravin Kumar (Google Labs) discussing generative AI and real-world applications; a session with Geetu Ambwani on data leadership and building value; and a fireside chat with Alex Filipchik on engineering ML.\n\n### High Signal Podcast\n\nA new High Signal episode featuring Ramesh Johari (Stanford professor) discusses building effective experimentation systems for continuous learning and innovation.  A clip from this insightful episode is included.\n\n### High-Impact Consulting with AI\n\nThis section discusses how to transition from hourly AI consulting to securing higher-value contracts, emphasizing the mindset and skills needed. A clip from a podcast with Jason Liu illustrates this.\n\n### Outliers Podcast Launch\n\nOuterbounds' new podcast, Outliers, features Fireside Chats with leading AI voices (Hilary Parker, Goku Mohandas, Chip Huyen, Michelle Carney, Jacopo Tagliabue).  Links are provided to listen.\n\n### On the Road: Community Engagement\n\nThe author shares experiences from recent AI community events, including teaching workshops and engaging with others in the field.", "url": "https://hugobowne.substack.com/p/escaping-ai-proof-of-concept-purgatory"}, {"title": "Michael Jordan: The Next Evolution of AI: Markets, Uncertainty, and Engineering Intelligence at Scale🔭", "short": "New AI podcast High Signal launches with Michael Jordan, Andrew Gelman, & Chiara Farronato!  Plus: a new GenAI course, scaling AI for smaller companies, and free tickets to the NYC AI CALM Summit! #AI #podcast #GenAI #datascience #machinelearning", "long": "### Launching *High Signal* Podcast\n\nThis new podcast features conversations with leading figures in AI, data science, and machine learning.  Recent episodes include discussions with Michael Jordan (UC Berkeley) on AI and economics, Andrew Gelman (Columbia University) on simulation and statistics, and Chiara Farronato (Harvard Business School) on collaborative decision-making.\n\n### New GenAI Course\n\nHugo Bowne-Anderson and Stefan Krawczyk are developing a new course focused on building complete GenAI applications, not just models. A survey is available to provide feedback and join the waitlist.\n\n### Reasonable Scale AI\n\nA discussion with Jacopo Tagliabue explores how companies outside big tech can effectively use AI, emphasizing data quality and efficient solutions over complex infrastructure.\n\n### Data Dialogs Session\n\nA session with Savin Goyal (Metaflow, Outerbounds, ex-Netflix) covered scaling AI platforms, common pitfalls, and integrating generative AI into existing systems.\n\n### Upcoming AI CALM Summit\n\nFree and discounted tickets are available for the NYC AI CALM Summit on generative AI and building AI assistants.  The summit includes sessions on scaling conversational AI and the future of voice technology.\n\n### Freelance AI Consulting\n\nA podcast with Jason Liu discusses the strategies and mindset for successful AI consulting and product building, including moving from hourly rates to larger contracts.\n\n### Workshops and Conferences\n\nHugo will lead hands-on workshops at PyData NYC (Nov 6-8) and MLOps World & Generative AI World Conference (Nov 7-8) on building multimodal generative AI apps and generative AI for software engineers.", "url": "https://hugobowne.substack.com/p/michael-jordan-the-next-evolution"}, {"title": "Building Reliable AI: Prompt Engineering, Fine-Tuned Models, and Efficient Workflows", "short": "Learn prompt engineering, explore open-source AI's future, build efficient agentic bots with Llama 8B, & accelerate data science workflows with Pixi! Plus, upcoming workshops on Generative AI at PyData NYC & MLOps World. #AI #LLM #PromptEngineering #OpenSourceAI #DataScience", "long": "### Prompt Engineering:  The article explores prompt engineering's importance in making AI more accessible, comparing it to training animals. It highlights the challenges, particularly with adversarial techniques, and shares a link to a two-part podcast discussing the rise of prompt engineering and its role in NLP's evolution.\n\n### Open-Source AI with Hailey Schoelkopf:  An interview with Hailey Schoelkopf of EleutherAI examines the future of open-source AI, its challenges, and the significance of AI model evaluation tools like the LM Evaluation Harness.  Topics include the importance of local models for privacy and the role of red teaming in AI safety.\n\n### Reliable Agentic Bots with Llama 8B:  This section details building reliable and cost-effective agentic bots using the Llama 8B model. It emphasizes the benefits of smaller, fine-tuned models over larger ones, highlighting cost efficiency, privacy, low latency, and the CALM paradigm for streamlined fine-tuning and deployment.\n\n### Accelerating Science with Pixi:  An interview with Eric Ma discusses how Pixi improves data science workflows, enhancing reproducibility and speed.  Key benefits include simpler reproducibility, increased efficiency, cross-environment compatibility, and suitability for data scientists and tool builders.\n\n### Upcoming Workshops and Conferences:  Hugo Bowne-Anderson announces his participation in upcoming workshops at PyData NYC (multimodal generative AI) and MLOps World/Generative AI World Conference (Generative AI for software engineers).  He also mentions the open PyData Global Call for Proposals.", "url": "https://hugobowne.substack.com/p/building-reliable-ai-prompt-engineering"}, {"title": "AI at NASA, Scaling Platforms at Uber, and the Future of Open-Source AI 🔭", "short": "AI at NASA, chatbot evaluations, Uber's AI platform, LlamaBot automation tool, and upcoming livestreams on prompt engineering & open-source AI.  #AI #ML #OpenSource #Chatbots #NASA #Uber", "long": "### AI at NASA\nNASA is integrating AI into its research, focusing on data accessibility and developing new metrics for measuring scientific impact beyond traditional publications.  They've launched an open-source foundational model based on the Landsat dataset, available on Hugging Face.\n\n### Evaluating Chatbots\nRobust evaluation of chatbot implementations is crucial.  Key metrics include containment rate, customer satisfaction, and cost efficiency.  Automated evaluation combined with manual review is recommended to avoid common pitfalls.\n\n### Uber's AI/ML Platform\nUber's AI/ML journey progressed through predictive ML, deep learning expansion, and now generative AI integration.  They're using a mix of GPT-4 and open-source Llama models, focusing on a unified API/UI and metrics like reliability, CSAT, and business impact.\n\n### LlamaBot\nLlamaBot, a Python-based tool, automates tasks like generating commit messages and querying documents using LLMs. It offers automated commit message generation with validation, smart text validation for Git workflows, and integration with local or cloud-based LLMs.\n\n### Upcoming Livestreams\nA livestream on prompt engineering, generative AI security, and the future of AI research will cover the evolution of prompt engineering, security concerns like prompt injections, and the intersection of prompt engineering with robotics, AR, and VR.  Another livestream will discuss the future of open-source AI and research infrastructure, focusing on EleutherAI and open-source model development.", "url": "https://hugobowne.substack.com/p/ai-at-nasa-scaling-platforms-at-uber"}, {"title": "How To Build A Travel AI Assistant That Doesn't Hallucinate 🤖", "short": "Learn to build a hallucination-free travel AI assistant, explore ML engineering challenges, delve into open-source AI research, and master AI platforms.  Plus, exciting upcoming events on NASA's AI use, AI-powered search, and the future of prompt engineering!", "long": "### How to Build a Travel AI Assistant\nThis article details a live coding session with Alan Nichol, CTO of Rasa, focusing on building a travel AI assistant that avoids hallucinations by combining LLMs with business logic.  Key takeaways include designing with business logic to prevent AI from fabricating information, maintaining accuracy through validation, and creating a practical travel assistant that can book flights and hotels.\n\n### Machine Learning Engineering with Santiago Valdarrama\nThe author discusses a conversation with Santiago Valdarrama about machine learning engineering.  The discussion covers data and model drift, the impact of changing smartphone camera quality on model predictions, and real-world examples like how COVID-19 affected demand forecasting models.\n\n### Open Source AI and Research at Eleuther AI\nA fireside chat with Hailey Schoelkopf of Eleuther AI is previewed.  Hailey maintains the LM Evaluation Harness used in many research papers.  The discussion will cover interpretability, alignment, and the challenges of making large language model research accessible beyond a few large companies.\n\n### Mastering AI Platforms at Uber\nThe author previews an upcoming Data Dialogues session with Min Cai from Uber. Min has a decade of experience in building Uber's machine learning platform. This talk will address topics like encouraging experimentation with generative AI, the growing importance of product management skills for data scientists, and fundamental AI leadership principles.\n\n### Other Upcoming Events\nSeveral additional upcoming events are mentioned, including a livestream on Open Science at NASA, a discussion with Paco Nathan on AI and search, and a panel on prompt engineering, security, and the future of AI research. These events offer diverse perspectives on current advancements in AI and related fields.", "url": "https://hugobowne.substack.com/p/how-to-build-a-travel-ai-assistant"}, {"title": "Where are you in the GenAI Hype Cycle?", "short": "GenAI app tutorial, podcast on NLP & AI regulation, NASA livestream on open science & AI, fireside chat on ML engineering, and Generative AI Hype Cycle discussion.  Join the Vanishing Gradients community!", "long": "### Building Your First Multimodal GenAI App\nHugo Bowne-Anderson shares a tutorial on creating a multimodal generative AI app, transforming text prompts into audio, video, and images.  The tutorial uses GitHub Codespaces, integrates with Streamlit for a dynamic web app, and leverages APIs from OpenAI, Replicate, Groq, and Hugging Face.\n\n### The AI Revolution will NOT be Monopolized\nA podcast discussion with Ines Montani and Matthew Honnibal (spaCy) explores the evolution of NLP, the balance between large and small models, human-in-the-loop AI, and the impact of AI regulation.\n\n### NASA, AI, and Rats in Space\nA forthcoming livestream with Chelle Gentemann (NASA) will cover measuring open science impact, scientific discovery, AI applications at NASA (including the intriguing case of rats in space!), and challenges in implementing open science.\n\n### From Theory to Practice: Machine Learning Engineering\nA fireside chat with Santiago Valdarrama will focus on bridging the gap between theoretical machine learning and practical engineering.  The event is part of an Outerbounds series.\n\n### Where are you in the GenAI Hype Cycle?\nA discussion on the current state of the Generative AI Hype Cycle, seeking reader feedback on their position within this cycle.  The author also promotes upcoming 'Data Dialogs' events.", "url": "https://hugobowne.substack.com/p/where-are-you-in-the-genai-hype-cycle"}, {"title": "Cutting AI Assistant Costs by Up to 77.8%: The Power of Enhancing LLMs with Business Logic", "short": "Cut AI assistant costs up to 77.8%!  New study shows enhancing LLMs with business logic boosts speed & reliability.  Plus, join Data Dialogs, a private forum for data leaders, & catch the upcoming livestream with spaCy creators! #AI #LLM #DataScience #ML", "long": "### Cutting AI Assistant Costs\n\nA recent study by Rasa, in collaboration with the author, reveals that enhancing Large Language Models (LLMs) with business logic significantly reduces costs.  Their CALM system achieved up to 77.8% cost reduction compared to LangChain/LangGraph, while also offering 4x faster response times and improved reliability in adhering to business rules.\n\n### Data Dialogs Launch\nA new series, \"Data Dialogs,\" is launched, offering a private online forum for data leaders to discuss challenges in data science, ML, and AI.  The first session features Brad Klingenberg, founder of Naro, discussing the impact of Generative AI on the field.\n\n### Insights from LLM Education\nThe author shares insights from a podcast interview with Dan Becker and Hamel Husain, who taught an LLM fine-tuning course to over 2000 participants.  Their experiences highlight the current state and future of AI education and application. A demo of a new application for creating 3D printable objects using LLMs is also highlighted.\n\n### NLP and AI Revolution with spaCy\nA forthcoming livestream with Ines Montani and Matthew Honnibal, creators of spaCy, is announced.  The discussion will cover incorporating Generative AI into robust AI systems, the importance of developer tooling, and building sustainable open-source companies.\n\n### Newsletter Subscription\nReaders are encouraged to subscribe to the newsletter for updates on future livestreams, events, and podcasts.  Links to a lu.ma calendar and YouTube channel are provided for easy access to additional content.", "url": "https://hugobowne.substack.com/p/cutting-ai-assistant-costs-by-up"}, {"title": "Building Reliable and Robust ML/AI Pipelines", "short": "New Vanishing Gradients newsletter!  Podcast with Shreya Shankar on robust AI pipelines & LLMs, fireside chat with Chip Huyen on the shift to AI Eng & foundation models, upcoming livestream with spaCy creators!  Plus, more livestreams & educational resources announced. #AI #ML #LLM #DataScience", "long": "### Building Reliable and Robust ML/AI Pipelines with Shreya Shankar\nThis podcast episode discusses the challenges of building reliable AI pipelines, focusing on large language models (LLMs).  Shreya Shankar, a researcher at UC Berkeley, shares her expertise gained from working at Viaduct, Google Brain, and Facebook.\n\n### From ML to AI Eng, Navigating the Shift to Foundation Models with Chip Huyen\nA fireside chat with Chip Huyen, a computer scientist at Voltron Data, explores the transition from traditional machine learning to AI engineering in the context of foundation models.  Topics include common GenAI platform components, AI failure types, RAG strategies, and fine-tuning complexities. \n\n### The NLP and AI Revolution with spaCy Creators Ines Montani and Matthew Honnibal\nA forthcoming livestream with Ines Montani and Matthew Honnibal delves into the NLP and AI revolution, the evolution of spaCy, and the challenges of building sustainable open-source companies.  Discussion will cover human-in-the-loop distillation and building robust AI systems using open-source tools. \n\n### What else is up?\nHugo Bowne-Anderson announces upcoming livestreams, including one with Dan Becker and Hamel Husain, discussing their experience teaching over 2000 students in their \\\"Mastering LLMs\\\" course.  He also highlights educational resources available from the course and shares a Johno Whitaker talk on fine-tuning.", "url": "https://hugobowne.substack.com/p/building-reliable-and-robust-mlai"}, {"title": "Rethinking Data Science, ML, and AI", "short": "Data science, ML, & AI newsletter! Podcast w/ Vincent Warmerdam (scikit-learn), course on improving LLMs & RAG apps, reproducible workflows w/ Pixi PDF, building reliable AI pipelines, and upcoming events w/ Chip Huyen & Dan Becker! Subscribe!", "long": "### Rethinking Data Science, ML, and AI\nThis newsletter covers data science, machine learning, and AI.  It's an experiment, so feedback is welcome.\n\n### Podcast with Vincent Warmerdam\nFeatures a podcast with Vincent Warmerdam, a scikit-learn expert, discussing innovative approaches in data science and highlighting a case study where reframing a problem led to significant improvements for the World Food Organization.\n\n### Systematically Improving LLM and RAG applications\nHighlights a course by Dan Becker and Jason Liu on systematically improving Large Language Model (LLM) and Retrieval Augmented Generation (RAG) applications, emphasizing a repeatable process for evaluation and improvement.\n\n### Reproducible Scientific Workflows\nDiscusses work with Wolf Vollprecht and his team on mamba and pixi, focusing on creating more reproducible scientific workflows with Pixi PDF, which embeds the entire development environment in a PDF for instant reproducibility.\n\n### Building Reliable ML and AI Pipelines\nSummarizes a livestream with Shreya Shankar about building custom, reliable AI pipelines, emphasizing good algorithms, data management, human-in-the-loop processes, and continuous improvement. \n\n### Upcoming Events\nA Fireside Chat with Chip Huyen is coming soon and another livestream with Dan Becker and Hamel Husain about teaching AI and LLMs is scheduled for early August. Subscribe to stay updated!", "url": "https://hugobowne.substack.com/p/rethinking-data-science-ml-and-ai"}, {"title": "42 Lessons from a Year of Building with AI Systems", "short": "42 Lessons from a year of building AI systems!  Experts share their experiences developing LLMs, conversational AI, & accelerating data analytics.  Listen to the podcast, read the blog, & register for the next livestream! #AI #LLM #DataScience #MachineLearning", "long": "### 42 Lessons from a Year of Building with AI Systems\nThis article summarizes a three-hour livestream with AI experts discussing their experiences building real-world AI applications.  Key takeaways include navigating the complexities of LLM development and deployment.\n\n### Developing and Training LLMs From Scratch\nThe article points to blog posts detailing the process of developing and training LLMs from scratch, including a live coding session on fine-tuning GPT-2 for spam classification.\n\n### Harnessing LLMs in Conversational AI\nIt highlights a blog post discussing the use of LLMs in conversational AI, drawing lessons from Rasa's journey in the field.  The focus is on practical applications and challenges.\n\n### Accelerating AI and Analytics\nA fireside chat with Josh Patterson on the future of data processing is summarized.  Topics covered include AI-accelerated data growth, faster data processing systems, and sustainable data centers.\n\n### Upcoming Livestream: Rethinking Data Science\nA preview of a future livestream with Vincent Warmerdam is given, promising a discussion on innovative approaches in data science and machine learning that challenges conventional thinking.  Registration is encouraged.\n\n### Subscribe for More\nThe article encourages readers to subscribe to the newsletter and YouTube channel for updates on future livestreams, events, and podcasts related to data science, ML, and AI.", "url": "https://hugobowne.substack.com/p/42-lessons-from-a-year-of-building"}, {"title": "AI and ML on the Command Line, Local LLMs, and How to Really Build Chatbots", "short": "AI/ML command line tools, local LLMs advantages, chatbot building insights, Conda ecosystem improvements, and lessons from a year of LLM app development.  Check out the latest Vanishing Gradients newsletter!", "long": "### AI and ML on the Command Line\nLearn how to use LLMs from the command line with Simon Willison's `llm` utility, enabling piping, automation, and interactive conversations logged to a local SQLite database.\n\n### Local LLMs: 10 Reasons Why\nDiscover the advantages of running LLMs locally: data privacy, performance gains, cost savings, customization, offline access, enhanced learning opportunities, open-source support, scalability, ethical benefits, and enhanced autonomy.\n\n### Building Effective Chatbots\nGain insights from a podcast interview with Alan Nichol of Rasa, discussing the evolution of chatbots, their applications, the impact of ChatGPT, limitations of prompt-based LLMs, and strategies for building chatbots incorporating business logic.\n\n### Revolutionizing Conda with Rust\nExplore Wolf Vollprecht's work on Mamba and Pixi, addressing package management challenges, aiming to improve software supply chain efficiency for data scientists and the accessibility of GenAI and foundation models.\n\n### Lessons from a Year of LLM Development\nJoin an upcoming livestream featuring experts who share their critical learnings from building real-world applications with LLMs, covering tactical, operational, and strategic insights for future AI product development.", "url": "https://hugobowne.substack.com/p/ai-and-ml-on-the-command-line-local"}, {"title": "Lessons From a Year of Building With LLMs", "short": "Lessons from a year of building with LLMs! Learn to avoid pitfalls, boost productivity with ChatGPT, and master in-context learning.  Livestreams with experts on June 20th. #LLMs #AI #GenerativeAI #MachineLearning #DataScience", "long": "### Lessons From a Year of Building With LLMs\nThis newsletter shares lessons from building products with LLMs, covering prompting, workflow optimization, evaluation, data handling, team roles, and MVP strategies.\nA livestream on June 20th with the \"LLM Mafia\" will discuss these topics further.\n\n### How to Build Terrible AI Systems\nA Vanishing Gradients podcast episode explores failure modes in building AI systems, offering advice on avoiding pitfalls.  The discussion includes practical strategies for building production-ready LLM apps and maintaining them. It offers insights on Jason Liu’s playbook for creating production-ready AI applications and includes a YouTube link.\n\n### Getting Started with Generative AI\nA post by Johno Whitaker introduces the GenAI mindset of combining atomic units to build AI applications, offering a simplified approach to leveraging Generative AI for various applications.\n\n### Boost Your Productivity with ChatGPT\nLearn how to use ChatGPT for basic knowledge work tasks, such as summarizing PDFs, extracting meeting notes, and transcribing videos.\n\n### Good Riddance to Supervised Learning\nA livestream with Alan Nichol discusses the limitations of supervised learning and the advantages of in-context learning with LLMs.\n\n### LLM Fine-Tuning for Data Scientists and Software Engineers\nThe Mastering LLMs course and conference feature new speakers and focuses on techniques relevant to data scientists and software engineers.  An update on the speakers is included, along with links to registration.", "url": "https://hugobowne.substack.com/p/lessons-from-a-year-of-building-with"}, {"title": "Building LLMs from Scratch, Learn from the Experts, and How to Build Terrible AI Systems", "short": "Learn to build LLMs from scratch, master fine-tuning with expert instructors, discover how to avoid building terrible AI, and explore the copyright challenges of generative AI.  New podcast, course, and O'Reilly essay!", "long": "### Building LLMs from Scratch\nLearn how to build LLMs from the ground up with insights from Sebastian Raschka in the Vanishing Gradients podcast.  The discussion covers the entire LLM lifecycle, required skills, hardware needs, and techniques like prompt engineering, fine-tuning, and RAG.\n\n### LLM Fine-Tuning Course\nEnroll in the new course, \"LLM Fine-Tuning for Data Scientists and Software Engineers,\" featuring experts Hamel Husain and Dan Becker. For $500, receive nearly $2500 worth of compute and software resources, plus access to a Discord community and office hours with leading experts in the field.\n\n### How to Build Terrible AI Systems\nJoin Hugo Bowne-Anderson and Jason Liu for a livestream on building terrible AI systems. This inverted approach focuses on identifying common failure modes and learning how to avoid them when building production LLM applications. The livestream provides a practical approach for building robust and effective AI systems.\n\n### ChatGPT and Copyright\nExplore the challenges of copyright in the age of generative AI in a recent O’Reilly Radar essay.  The essay discusses how LLMs reproduce training data and the need for new paradigms beyond copyright to address ethical and legal concerns in the field of generative AI.", "url": "https://hugobowne.substack.com/p/building-llms-from-scratch-learn"}, {"title": "Coming soon", "short": "Vanishing Gradients, by data scientist Hugo Bowne-Anderson, is coming soon! Get ready for insightful content on data, ML & AI. Subscribe now to stay ahead of the curve!", "long": "### Vanishing Gradients: A Sneak Peek\n\nThis article is a brief announcement for the Vanishing Gradients publication, hosted by data scientist Hugo Bowne-Anderson.  The publication focuses on providing insights into the world of data, machine learning, and artificial intelligence.  The author is well-known for his expertise and his podcast of the same name.\n\n### Author's Background\n\nHugo Bowne-Anderson is a multifaceted professional with experience as a data scientist, educator, evangelist, content marketer, data strategy consultant, and podcast host. His wide range of experience in the field ensures a varied and insightful perspective on data-related topics.\n\n### Publication Focus\n\nVanishing Gradients covers various data-related themes, offering explanations that cater to both the knowledgeable and curious.  The aim is to demystify complex AI and ML concepts and make them accessible to a broad audience.\n\n### Upcoming Content\n\nThe publication promises a future release of engaging and informative content covering the fascinating complexities of the data, ML, and AI worlds. This content is expected to help readers keep up with the latest advancements and trends in the field.\n\n### Subscribe Now\n\nReaders are encouraged to subscribe for future updates on publication releases and keep informed about progress in the AI and ML sectors.  This will ensure they stay at the forefront of the fast-evolving technological landscape.", "url": "https://hugobowne.substack.com/p/coming-soon"}]}